{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "CrossListOpen", 
    "href": "/2017/spring/LLS/596/65259.json", 
    "id": "65259", 
    "meetings": {
        "meeting": {
            "buildingName": "1207 W Oregon", 
            "daysOfTheWeek": "T", 
            "end": "04:20 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Ruiz, S", 
                    "firstName": "S", 
                    "lastName": "Ruiz"
                }
            }, 
            "roomNumber": "133", 
            "start": "02:00 PM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Graduate Seminar in LLS", 
            "href": "/2017/spring/LLS/596.json", 
            "id": "596"
        }, 
        "subject": {
            "content": "Latina/Latino Studies", 
            "href": "/2017/spring/LLS.json", 
            "id": "LLS"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "SR", 
    "sectionStatusCode": "A", 
    "sectionText": "Topic: In the Realm of the Senses: Minoritarian Aesthetics. Meets with AAS 590 & ENGL 581. For bell hooks: \"aesthetics is more than a philosophy or theory of art and beauty; it is a way of inhabiting space, a particular location, a way of looking and becoming,\" or too, a pathway into the complicated political life of minoritarian subjects. In order to assess such complexity, this course will go beyond the aesthetic as merely a visual and aural construction to include touch, taste, smell, and the sense of the minoriatrian body in time and space. By drawing on and departing from traditional constructions of aesthetic theory, this course will turn to philosophy, performance studies, literary theory, visual culture, cultural studies, and ethnic and area studies to answer the following questions: how can the aesthetic help inform our understanding of difference, and resistance? And how can minoritarian politics engage with the sensorium, moving deeply into the realm of the senses, and the social spaces of the communal?", 
    "sectionTitle": "Minoritarian Aesthetics", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}