{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ADV/460.xml", "id": "ADV 460", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ADV.xml", "id": "ADV", "content": "Advertising"}}, "label": "Innovation in Advertising", "description": "This course is intended to improve creative and critical thinking skill in advertising planning by understanding the core technology and perspective of digital and other innovative media in the context of integrated communication. This will allow students to understand how consumers perceive and process digital advertising messages; to research critical questions in digital consumer behavior; to learn how to utilize digital and non-digital media in the context of integrated communication; to apply knowledge of digital communication technology to the real-world advertising cases. 3 undergraduate hours. 3 graduate hours. Credit is not given for ADV 460 if credit for the Digital Advertising section of ADV 490 has been earned. Prerequisite: ADV 283, ADV 284.", "creditHours": "3 hours.", "courseSectionInformation": "3 undergraduate hours. 3 graduate hours. Credit is not given for ADV 460 if credit for the Digital Advertising section of ADV 490 has been earned. Prerequisite: ADV 283, ADV 284.", "sectionRegistrationNotes": "Restricted to Agr & Environmental Cmc & Educ or Advertising or Agricultural Communications major(s). Restricted to students with Junior or Senior class standing.", "sections": {"section": [{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ADV/460/60087.xml", "id": "60087", "content": "D"}, {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ADV/460/61526.xml", "id": "61526", "content": "E"}]}}