{"endDate":"2017-05-03-05:00","enrollmentStatus":"CrossListOpen","href":"/2017/spring/ENGL/268/60057.json","id":"60057","meetings":[{"buildingName":"Foreign Languages Building","daysOfTheWeek":"MWF","end":"10:50 AM","id":"0","instructors":[{"firstName":"S","lastName":"Hilger","name":"Hilger, S"},{"firstName":"N","lastName":"Taub","name":"Taub, N"}],"roomNumber":"G32","start":"10:00 AM","type":{"code":"LEC","label":"Lecture"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/ENGL/268.json","id":"268","label":"The Holocaust in Context - ACP"},"subject":{"href":"/2017/spring/ENGL.json","id":"ENGL","label":"English"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNumber":"NS","sectionStatusCode":"A","sectionText":"GER 260 - The Holocaust in Context: Postwar Holocaust Representation in Literature and Film  As the Holocaust recedes into the historical past, our knowledge of it increasingly comes from representations of it in books and films. This course does not focus on the Holocaust as a historical event that remains in the past but instead focuses on how films, books, comic books, and even monuments depict the Holocaust for contemporary audiences. This course will focus on two objectives. First, we will examine the various debates and controversies surrounding the issue of artistic representation of the Holocaust and discuss some of the theoretical and philosophical texts that have formed the core of Holocaust Studies by critics such as James Young and Marianne Hirsch. Second, we will explore the ways in which literature and film, both fictional and documentary, have attempted to represent the events of the Holocaust. We will examine texts from various countries but we will place a particular emphasis on American representations. Central to our investigation will be to question how different times and places affect the way the Holocaust is depicted, what role memory plays, and the problems and limits of language.","startDate":"2017-01-17-06:00","statusCode":"A"}
