{"creditHours":"3 hours","endDate":"2017-05-03-05:00","enrollmentStatus":"Open (Restricted)","href":"/2017/spring/PS/377/65268.json","id":"65268","meetings":[{"buildingName":"David Kinley Hall","daysOfTheWeek":"TR","end":"03:20 PM","id":"0","instructors":[{"firstName":"B","lastName":"Miller","name":"Miller, B"}],"roomNumber":"222","start":"02:00 PM","type":{"code":"LCD","label":"Lecture-Discussion"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/PS/377.json","id":"377","label":"Topics Contemp Pol Theory"},"subject":{"href":"/2017/spring/PS.json","id":"PS","label":"Political Science"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNumber":"BM1","sectionStatusCode":"A","sectionText":"Topic: Justice in Politics Justice has famously been called both the first condition of humanity and the first virtue of social institutions. In this course, we will explore three fundamental questions about the ideal of a just society. We will do this by exploring three competing theories of justice: utlitarianism, libertarianism, and egalitarian liberalism. We will explore the core ideas of these theories and consider their implications for some longstanding debates in moral and political theory: enforcing sexual morality, protecting free expression, religious liberty, regulating labor markets, guaranteeing the rule of law, ensuring equal opportunities through schools and elections, establishing group rights, and regulating reproductive rights. As a student, through discussion in class, you will be taught to (1) make explicit some of your fundamental political values and principles that guide your personal convictions about public issues in politics, law and policy, (2) assess the plausibility of your values and principles, and (3) recognize how you can use common reason to argue about political values and principles on the basis of mutual respect.\"  Restricted to Political Science majors through November 14, 2016.","sectionTitle":"Justice in Politics","startDate":"2017-01-17-06:00","statusCode":"A"}
