{"creditHours":"3 hours.","description":"This introductory course explores multiple dimensions of diversity in a pluralistic and increasingly globalized society. Using a social work strengths perspective as well as historical, constructivist, and critical conceptual frameworks; the course examines issues of identity, culture, privilege stigma, prejudice, and discrimination. The social construction and implications of race, class, gender, sexual orientation, and other dimensions of difference is examined at individual, interpersonal, and systems levels. Students are expected to use the course material to explore their personal values, biases, family backgrounds, culture, and formative experiences in order to deepen their self-awareness and develop interpersonal skills in bridging differences. Finally, students apply learning from the course to identify characteristics of effective social work and other health and human service provision among people culturally different themselves; and to identify opportunities for change contributing to prejudice reduction and cross-cultural acceptance at home, work and in society.","genEdCategories":[{"description":"Cultural Studies: Non-Western/U.S. Minority Culture(s)","id":"CNW","attributes":[{"code":"1US","label":"UIUC: US Minority Culture(s)"}]},{"description":"Advanced Composition","id":"ACP","attributes":[{"code":"1CLL","label":"UIUC: Advanced Composition"}]}],"href":"/2017/spring/SOCW/300.json","id":"SOCW 300","label":"Diversity: Identities & Issues","parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"subject":{"href":"/2017/spring/SOCW.json","id":"SOCW","label":"Social Work"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"sectionDegreeAttributes":"Advanced Composition, and US Minority Culture(s) course.","sectionRegistrationNotes":"Not intended for students with Freshman class standing.","sections":[{"href":"/2017/spring/SOCW/300/58396.json","id":"58396","label":"A"},{"href":"/2017/spring/SOCW/300/52693.json","id":"52693","label":"B"}]}
