{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BADM/395/53555.xml", "id": "53555", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BADM.xml", "id": "BADM", "content": "Business Administration"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BADM/395.xml", "id": "395", "content": "Senior Research II"}}, "sectionNumber": "BRM", "sectionTitle": "Brand Management", "creditHours": "3 hours", "statusCode": "A", "sectionText": "It is required for students to have completed BADM 320 before taking this course. This is a starred* elective course for Marketing students. This course will open to all students in the College of Business on Monday, November 14, 2016 at approximately 9:00 a.m.  Marketers recognize that brands are the most valuable assets that a firm can have. Companies sometimes go through turbulent times, but their brands frequently withstand these difficulties and stay over time. As important as brands are for a company?s long-term success, the study of how to build strong brands has been somewhat neglected in business schools? programs. Brand Management is an advanced Marketing elective that addresses the key issues of brand asset management faced by firms in the 21st century.  Brand Management helps to integrate theory and practice in order to provide students with an actionable theoretical framework that they can use in the workplace. Class discussions will focus on providing theoretical tools for uncovering and understanding the associations that consumers establish with their brands, and for predicting the effects of these associations on brand-related judgments and behaviors. This course draws heavily on theories of consumer behavior to explain how consumers react to a firm?s brand strategies. The course will make you aware of current issues in brand management and will encourage discussions about how to address these issues using theoretically sound approaches.", "sectionNotes": "Restricted to College of Business. Restricted to Marketing or Information Sys & Info Tech or Supply Chain Management or Business Process Management or Management major(s) or minor(s). Restricted to students with Junior or Senior class standing.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "09:30 AM", "end": "10:50 AM", "daysOfTheWeek": "TR", "roomNumber": "2001", "buildingName": "Business Instructional Fac", "instructors": {"instructor": {"firstName": "C", "lastName": "Torelli", "content": "Torelli, C"}}}}}