{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/543/43359.xml", "id": "43359", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/543.xml", "id": "543", "content": "Seminar Mod British Lit"}}, "sectionNumber": "E", "sectionTitle": "Yeats and Bowen", "statusCode": "A", "sectionText": "Topic Section E: Yeats and Bowen:  Imagination and History as Twin ?Realities?  Jane Bennett, before writing Vibrant Matter, published a book on Enchantment in Modern Life in which she argued that in a disenchanted age, it is important to reconsider the unexpectedly ethical potential of moments of enchantment. In this course, we will look at enchantment as a literary goal and as a political plight for the Irish (effectively immobilized by the British). For the section on W.B. Yeats, we will explore Yeats? interest in magic and his desire to have his poems sung (accompanied by a psalter) as different responses to the complex dangers and possibilities of enchantment, a word that comes from the French verb ?to sing? (chanter). We will probe the kinship between magic and imagination in an effort to ascertain in what sense the imagined or the vanished may be experienced as ?real.? We will investigate the history of fairies in Ireland as ancient gods and goddesses who can still be experienced through nature in the present, and we will analyze Yeats? assertion in his late poems that death and life are also products of the human imagination.  When we turn to Elizabeth Bowen, we will begin with selected stories that insist on the continuing reality of people and places that have vanished or that exist only in the imagination. Then we will read three of her novels?probably The House in Paris, The Last September, and Eva Trout?in order to test the hypothesis that things can be sentient, with a ?magical? vitality that exceeds human reason. Readings will include chapters from Bennett, from Thomas Moore?s The Re-enchantment of Everyday Life, and selections from Heidegger. Literary works will include Yeats? poetry, selected plays and stories, selected short stories by Bowen, and two-three of her novels.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "01:00 PM", "end": "02:50 PM", "daysOfTheWeek": "W", "roomNumber": "113", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "V", "lastName": "Mahaffey", "content": "Mahaffey, V"}}}}}