{
    "creditHours": "4 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open (Restricted)", 
    "href": "/2017/spring/CS/598/61163.json", 
    "id": "61163", 
    "meetings": {
        "meeting": {
            "buildingName": "Siebel Center for Comp Sci", 
            "daysOfTheWeek": "TR", 
            "end": "03:15 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Caccamo, M", 
                    "firstName": "M", 
                    "lastName": "Caccamo"
                }
            }, 
            "roomNumber": "1304", 
            "start": "02:00 PM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Special Topics", 
            "href": "/2017/spring/CS/598.json", 
            "id": "598"
        }, 
        "subject": {
            "content": "Computer Science", 
            "href": "/2017/spring/CS.json", 
            "id": "CS"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNotes": "Restricted to Graduate - Urbana-Champaign.", 
    "sectionNumber": "CPS", 
    "sectionStatusCode": "A", 
    "sectionText": "Course description:  In this course, we will delve into topics that deal with the design and temporal analysis of cyber-physical and embedded systems. The goal of this course is to provide a deep understanding about resource management, analysis and safety of modern embedded systems that interact with the physical world, especially those that have different degrees of criticality and stringent timing requirements. Examples of such systems include modern automobiles, avionics and flight systems, space vehicles and satellites, medical equipment, power distribution grid, and robotics devices among others. This course has a seminar-based structure where instructor and students give in class presentations about state-of-art research papers published in top conferences and journals. The course is structured to improve students' research skills and their ability for critical thinking. In-class discussion will focus on state-of-art research work on cyber-physical and real-time embedded systems. Part of studied theory will be applied to the design of a simple flight control system for an Unmanned Aerial Vehicle (UAV); coding and testing will use an emulation environment as testbed. Course requirements include a project to be completed by students organized as teams.", 
    "sectionTitle": "Cyber Physical-Systems Tech", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}