{"creditHours":"3 hours","endDate":"2017-05-03-05:00","enrollmentStatus":"Open (Restricted)","href":"/2017/spring/PSYC/396/48453.json","id":"48453","meetings":[{"buildingName":"Psychology Building","daysOfTheWeek":"TR","end":"01:50 PM","id":"0","instructors":[{"firstName":"F","lastName":"Dolcos","name":"Dolcos, F"}],"roomNumber":"29","start":"12:30 PM","type":{"code":"LCD","label":"Lecture-Discussion"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/PSYC/396.json","id":"396","label":"Intermediate Current Topics in Psychology"},"subject":{"href":"/2017/spring/PSYC.json","id":"PSYC","label":"Psychology"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNotes":"Restricted to students with Senior class standing. Restricted to Undergrad - Urbana-Champaign.","sectionNumber":"FD","sectionStatusCode":"A","sectionText":"Senior priority enrollment begins November 2nd. Junior priority enrollment begins November 9th.Open enrollment begins at 10am on November 21st. This course discusses key concepts in the literature on emotion-cognition interactions, with particular emphasis on factors, skills, and mechanisms that influence our resilience in the face of emotional and cognitive challenges. Emotions can influence pretty much any aspect of our cognition, from early stages of processing during initial perception and experiencing of an emotional event (such as a   romantic dinner or a stressful exam) to later stages of processing that will eventually influence our memories of the events, along with the decisions to pursue or avoid similar situations in the future. Emotion processing, however, is also susceptible to cognitive influences, as we are also able to control our emotional responses, decide whether to embrace or avoid emotional situations, or decide whether to let our decisions be driven by emotions or not. Importantly, these emotion-cognition interactions are also critical for adjusting our social behavior in healthy functioning (for instance, by controlling our reactions if emotional display is not   appropriate), and their dysfunction is associated with clinical conditions such as depression and anxiety. Therefore, \"pathways to resilience\" that protect against such dysfunctions when facing adversity will receive particular attention, based on examples with applicability to real-life situations. *Approved for General Social/Personality Psychology Concentration**","sectionTitle":"Emotion, Cognition & The Brain","startDate":"2017-01-17-06:00","statusCode":"A"}
