{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/LIS/451.xml", "id": "LIS 451", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/LIS.xml", "id": "LIS", "content": "Library and Information Science"}}, "label": "Intro to Network Systems", "description": "Hands-on introduction to technology systems for use in information environments. The course steps students through choosing, installing, and managing computer hardware and operating systems, as well as networking hardware and software. The course also explores alternatives for administering IT and how to assess emerging technologies and their applicability to library settings. While students are expected to have basic computer competencies per the GSLIS admissions requirements, the goal of the course is to provide practical detailed knowledge of the technology for all levels of competency. The primary objective is to provide a conceptual understanding of the topics of the day through concrete hands-on examples of implementation. By learning the underlying concepts, students will be better prepared to help design networked systems that not only work well today, but also develop systems that can be easily adapted for the needs and technologies of tomorrow. Additional fees may apply. See Class Schedule. 4 undergraduate hours. 4 graduate hours.", "creditHours": "4 hours.", "courseSectionInformation": "Additional fees may apply. See Class Schedule. 4 undergraduate hours. 4 graduate hours.", "sectionDeptRestriction": "Restricted to students in the Information Sciences department.", "sections": {"section": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/LIS/451/40990.xml", "id": "40990", "content": "LE"}}}