{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/SHS/473.xml", "id": "SHS 473", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/SHS.xml", "id": "SHS", "content": "Speech and Hearing Science"}}, "label": "Augmentative & Alt Comm", "description": "Introduces students to the field of augmentative and alternative communication (AAC), to the range of assistive technologies, and to diagnostic and treatment approaches used by speech-language pathologists. Focuses on the communicative needs of adults and children with acquired communication disorders in a variety of settings (e.g., hospital, school, home, work). 2 to 4 undergraduate hours. 2 to 4 graduate hours. Prerequisite: For undergraduate credit, 2 or 3 hours, students must have senior level status in the SHS Program, or consent of instructor. Additional work is involved for 3 hours. For graduate credit, 2 to 4 hours, students must have graduate level status in the SHS Program, or consent of instructor. Additional work involved for 4 hours.", "creditHours": "2 TO 4 hours.", "courseSectionInformation": "2 to 4 undergraduate hours. 2 to 4 graduate hours. Prerequisite: For undergraduate credit, 2 or 3 hours, students must have senior level status in the SHS Program, or consent of instructor. Additional work is involved for 3 hours. For graduate credit, 2 to 4 hours, students must have graduate level status in the SHS Program, or consent of instructor. Additional work involved for 4 hours.", "sections": {"section": [{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/SHS/473/54967.xml", "id": "54967", "content": "G4"}, {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/SHS/473/54625.xml", "id": "54625", "content": "UG3"}]}}