{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open (Restricted)", 
    "href": "/2017/spring/ENGL/397/32116.json", 
    "id": "32116", 
    "meetings": {
        "meeting": {
            "buildingName": "English Building", 
            "daysOfTheWeek": "W", 
            "end": "01:50 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Trilling, R", 
                    "firstName": "R", 
                    "lastName": "Trilling"
                }
            }, 
            "roomNumber": "123", 
            "start": "12:00 PM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Honors Seminar II", 
            "href": "/2017/spring/ENGL/397.json", 
            "id": "397"
        }, 
        "subject": {
            "content": "English", 
            "href": "/2017/spring/ENGL.json", 
            "id": "ENGL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "X", 
    "sectionStatusCode": "A", 
    "sectionText": "Topic Section X: Medieval Bodies: Materiality in the Middle Ages When we think of medieval attitudes toward the body, we tend to focus on notions of the flesh as a site of sin and corruption. But, like us, the Middle Ages viewed the body in a variety of ways: as an object of beauty, as the seat of subjectivity, as a visible sign of an individual?s character, and even as a vehicle for redemption. In this course, we will begin with an overview of different theoretical models for thinking about the body before moving on to accounts of the body ranging from medical treatises, hagiography, sermons, and penitentials to romance, travel narratives, and epics. Students will gain knowledge not only of these primary texts, but also of how literary studies have approached the question of the body in the past fifty years. They will be asked to address questions of gender, race, sexuality, disability, and anthropocentrism, and we will also reflect on how current engagements between contemporary modes of thought and historically distant objects continue to restructure the assumptions we make about texts. The course will culminate in an independent research project, in which students will select their own topics, texts, and methodologies to investigate aspects of the body in the Middle Ages that are most interesting to them.", 
    "sectionTitle": "Medieval Bodies", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}