{
    "creditHours": "4 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "CrossListOpen (Restricted)", 
    "href": "/2017/spring/ENGL/455/32210.json", 
    "id": "32210", 
    "meetings": {
        "meeting": {
            "buildingName": "Armory", 
            "daysOfTheWeek": "MW", 
            "end": "02:50 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Newcomb, J", 
                    "firstName": "J", 
                    "lastName": "Newcomb"
                }
            }, 
            "roomNumber": "148", 
            "start": "01:00 PM", 
            "type": {
                "code": "S1 ", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Major Authors", 
            "href": "/2017/spring/ENGL/455.json", 
            "id": "455"
        }, 
        "subject": {
            "content": "English", 
            "href": "/2017/spring/ENGL.json", 
            "id": "ENGL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNotes": "Restricted to Graduate - Urbana-Champaign.", 
    "sectionNumber": "2G", 
    "sectionStatusCode": "A", 
    "sectionText": "Topic Section 2G: Citizens Coen: The Cinema of the Coen Brothers Over nearly thirty years Joel and Ethan Coen have occupied a distinctive place in American cinematic culture, as postmodern auteurs who gleefully violate the stylistic ?rules of the game? while also paying reverent homage to previous moments in American films. Their films consistently foreground their own roles as creators, which has made them key predecessors for later ?star? directors such as Tarantino and Spike Jonze; yet in their personal lives they don?t court flamboyant celebrity but remain quietly devoted to their art.  They have won many awards including the Oscar, yet they are still regarded with skepticism by some academic critics who find their films all about style and genre pastiche rather than substance. This class will explore these contradictions and many others as we survey the Coens? work of the past three decades, along with some of the ?originals? that have inspired them to rethink cinematic genres, especially the screwball comedy, the Hitchcockian thriller, the gangster picture, and the hard-boiled film noir.  The syllabus will certainly include, among others, Blood Simple, Raising Arizona, Miller?s Crossing, The Hudsucker Proxy, Fargo, The Big Lebowski, No Country for Old Men, O Brother Where Art Thou?, and The Man Who Wasn?t There, along with Sturges? Sullivan?s Travels and the original ?Ealing comedy? The Ladykillers. The class involves a two-hour weekly screening and a two-hour discussion session, both of which are mandatory.  You can expect essays, quizzes, brief oral presentations, and a final exam.", 
    "sectionTitle": "Cinema of the Coen Brothers", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}