{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/EPS/554.xml", "id": "EPS 554", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/EPS.xml", "id": "EPS", "content": "Educational Policy Studies"}}, "label": "New Media and Literacies", "description": "This course is designed to address issues of language and literacy, not only for language arts teachers, but all educators in all disciplines and at all levels, where students are required to represent their knowledge in writing as well as other media. It will introduce the 'Multiliteracies' theory of literacy learning which recognizes that the contemporary communications environment is increasingly multimodal. Written language today is more closely connected with oral, visual, gestural, tactile and spatial modes. To remain relevant, effective pedagogy needs to connect with the new communications media, and to explore their underlying processes. The course will focus on current trends in literacy instruction, not only in language arts or composition classes, but academic literacies across all curriculum areas. The course will also investigate the implications of new media of language and literacy and explore the implications of developments in the contemporary media, particularly the new, digital media. 4 graduate hours. No professional credit.", "creditHours": "4 hours.", "sectionDateRange": "Meets 17-Jan-17 - 10-Mar-17.", "courseSectionInformation": "4 graduate hours. No professional credit.", "sections": {"section": [{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/EPS/554/65681.xml", "id": "65681", "content": "A"}, {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/EPS/554/65680.xml", "id": "65680", "content": "ONL"}]}}