{
    "courseSectionInformation": "3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241 and one of MATH 415 or MATH 416 or equivalent.", 
    "creditHours": "3 OR 4 hours.", 
    "description": "Introductory course in modern differential geometry focusing on examples, broadly aimed at students in mathematics, the sciences, and engineering. Emphasis on rigorously presented concepts, tools and ideas rather than on proofs. The topics covered include differentiable manifolds, tangent spaces and orientability; vector and tensor fields; differential forms; integration on manifolds and Generalized Stokes Theorem; Riemannian metrics, Riemannian connections and geodesics. Applications to configuration and phase spaces, Maxwell equations and relativity theory will be discussed. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241 and one of MATH 415 or MATH 416 or equivalent.", 
    "href": "/2017/spring/MATH/481.json", 
    "id": "MATH 481", 
    "label": "Vector and Tensor Analysis", 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "subject": {
            "content": "Mathematics", 
            "href": "/2017/spring/MATH.json", 
            "id": "MATH"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "sections": {
        "section": [
            {
                "content": "F13", 
                "href": "/2017/spring/MATH/481/38087.json", 
                "id": "38087"
            }, 
            {
                "content": "F14", 
                "href": "/2017/spring/MATH/481/38089.json", 
                "id": "38089"
            }
        ]
    }
}