{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CS/598/56940.xml", "id": "56940", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CS.xml", "id": "CS", "content": "Computer Science"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CS/598.xml", "id": "598", "content": "Special Topics"}}, "sectionNumber": "ACK", "sectionTitle": "Experimental Methods of HCI", "creditHours": "4 hours", "statusCode": "A", "sectionText": "Course description: This course covers conceiving, designing, performing, analyzing data and reporting the results of experiments in HCI contexts and evaluating interactive technologies in engineering. Topics include defining the research question, selecting experimental objects, tasks, and participants, the ethical protection of subjects, selecting an experimental design, threats to validity, the collection and analysis of both qualitative and quantitative data and reporting experimental research in publications. Both parametric and nonparametric data analysis are covered, including the most commonly used inferential statistical tests such as repeated- and independent-measures ANOVA, post-hoc Tukey, Wilcoxon, Mann-Whitney, Kruskal-Wallis and others. Statistical material is taught using methods and examples based on mathematical foundations rather than with a statistical analysis software language or package to provide students a rigorous and intuitive understanding of these methods to complement the conveniences these programming environments provide in everyday research practice. Class time includes lectures based on an e-book text available from the library and critiques of recently published articles reporting experimental research in HCI and human factors. Grades are based on homework and 2 exams. Open to advanced undergraduates with permission of instructor.", "sectionNotes": "Restricted to Graduate - Urbana-Champaign.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LEC", "content": "Lecture"}, "start": "11:00 AM", "end": "12:15 PM", "daysOfTheWeek": "WF", "roomNumber": "1131", "buildingName": "Siebel Center for Comp Sci", "instructors": {"instructor": {"firstName": "A", "lastName": "Kirlik", "content": "Kirlik, A"}}}}}