{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ARTE/480.xml", "id": "ARTE 480", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ARTE.xml", "id": "ARTE", "content": "Art--Education"}}, "label": "Popular Visual Culture", "description": "Focuses primarily on contemporary popular culture, but also draws upon fine art, folk art, and indigenous art from both the past and the present. Considers the often troubled relationships between the pleasures of visual culture and its ideologies. Students examine the literature of visual culture studies and develop research skills by examining a specific site of visual culture of their own choosing in terms of aesthetic pleasures and ideology including but not limited to sexism, class, ethnicity, religion, homophobia, and xenophobia. Theories of the body, consumerism, and globalization, among others will be considered. Additional fees may apply. See Class Schedule. 3 undergraduate hours. 4 graduate hours. May be repeated in separate terms to a maximum of 6 undergraduate hours or 8 graduate hours.", "creditHours": "3 OR 4 hours.", "courseSectionInformation": "Additional fees may apply. See Class Schedule. 3 undergraduate hours. 4 graduate hours. May be repeated in separate terms to a maximum of 6 undergraduate hours or 8 graduate hours.", "classScheduleInformation": "A student registered in one or more Art & Design course(s) exhibiting this message, will be assessed a $95 facility use fee once each term.", "sections": {"section": [{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ARTE/480/53016.xml", "id": "53016", "content": "PDG"}, {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ARTE/480/52291.xml", "id": "52291", "content": "PDU"}]}}