{"creditHours":"3 hours","endDate":"2017-05-03-05:00","enrollmentStatus":"Open","href":"/2017/spring/ECE/498/65856.json","id":"65856","meetings":[{"buildingName":"Electrical & Computer Eng Bldg","daysOfTheWeek":"TR","end":"10:50 AM","id":"0","instructors":[{"firstName":"L","lastName":"Gao","name":"Gao, L"}],"roomNumber":"2013","start":"09:30 AM","type":{"code":"LEC","label":"Lecture"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/ECE/498.json","id":"498","label":"Special Topics in ECE"},"subject":{"href":"/2017/spring/ECE.json","id":"ECE","label":"Electrical and Computer Engineering"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNumber":"LG","sectionStatusCode":"A","sectionText":"Prerequisites: ECE 455 or ECE 460 or PHYS 402.   The course will be primarily intended for graduate students or senior undergraduates who are interested in designing and building real-world optical imaging systems. The course will cover the topics of geometrical ray tracing, first-order design, optical aberration theory, lens optimization, and tolerance analysis. During the course, the students will apply real-world optical design processes: defining the problem, identifying specifications and constraints, developing an optical design, evaluating the performance, selecting a final design, and actually building and testing the final design.  Specifically, this course will be taught with practical lens design examples using modern lens design software, such as Zemax. In addition, the instructor will teach the students how to design optomechanics and integrate them with optical designs using the 3D CAD software, such as Solidworks. To provide hands on exposure to elementary and advanced imaging systems, this course will also consist of several lab sections, which will be performed in a dedicated optics class room (ECE 3016). During these lab sections, the students will build optical imaging systems based on their own designs and evaluate their imaging performance.","sectionTitle":"Optical Design of Imaging Syst","startDate":"2017-01-17-06:00","statusCode":"A"}
