{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Closed", 
    "href": "/2017/spring/ENGL/119/47149.json", 
    "id": "47149", 
    "meetings": {
        "meeting": {
            "buildingName": "English Building", 
            "daysOfTheWeek": "TR", 
            "end": "03:15 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Baron, I", 
                    "firstName": "I", 
                    "lastName": "Baron"
                }
            }, 
            "roomNumber": "150", 
            "start": "02:00 PM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Literature of Fantasy", 
            "href": "/2017/spring/ENGL/119.json", 
            "id": "119"
        }, 
        "subject": {
            "content": "English", 
            "href": "/2017/spring/ENGL.json", 
            "id": "ENGL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "S", 
    "sectionStatusCode": "A", 
    "sectionText": "Harry Potter and More: When Harry Potter and the Philosopher?s Stone was published in June of 1997, it was largely regarded as a piece of children?s fiction about a ten-year-old orphan boy who discovers he has supernatural powers and goes off to Hogwarts School of Witchcraft and Wizardry. It seemed nothing more than a charming piece of fantasy lit destined for the shelves of the young adult sections of bookstores and libraries. What then made the Harry Potter novels suddenly transform into a cultural phenomenon that captured the imaginations of both children and adults? Why have these novels become the backbone of a global literary empire? What is the magic behind Harry Potter? In this course, we?ll explore the mythos of the Harry Potter novels and how they?re steeped in a rich tradition of both canonical British literature. We?ll focus on social justice and examine the political forces that led to the formation of fantasy literature as a separate genre in the UK and what makes British fantasy novels unique. Our excursion into fantasy literature will reveal how these tales became a covert way to explore the inequalities that the Industrial Revolution ignited; a rising entrepreneurial middle class and a permanent urban underclass held in place by rigid policies guided by genetic superiority. We?ll examine fantasy novels as discrete organic political entities that grew into a vast literary network of interlinking commentaries on British social issues such as class, education, social welfare, disability, gender rights, and racial equality. Ultimately, we?ll explore how the Potter novels explore the rise of the Alt-Right and a dark speculative vision of the Brexit vote. Students will be expected to engage actively in in the classroom and to write three papers and give oral reports on the historical and political history of the novels we?re studying. Novels include but may not be limited to: The Fellowship of the Rings, The Golden Compass, Harry Potter and the Philosopher?s Stone, Harry Potter and the Chamber of Secrets, Harry Potter and the Prisoner of Azkaban, Harry Potter and the Order of the Phoenix, Harry Potter and the Half-Blood Prince and Harry Potter and The Deathly Hallows.", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}