{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BTW/263/31555.xml", "id": "31555", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BTW.xml", "id": "BTW", "content": "Business and Technical Writing"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BTW/263.xml", "id": "263", "content": "Writing in the Disciplines"}}, "sectionNumber": "X", "sectionTitle": "Cross-Cultural Communication", "statusCode": "A", "sectionText": "Topic Section X: Cross-Cultural Commication: Investigating and Problem-Solving Do Chinese companies value authority more than U.S. companies?  Do German executives reward innovation and creativity more than their Brazilian counterparts? How can I argue, express disagreement, and say ?no? effectively if I want to be successful in a career in another country? The answers to these questions about business and communication in an international context may surprise you.  We will pursue them (and many more!) in this class.  We will investigate international cultures and international businesses, and solve real problems that organizations face when they take their products and services to new countries. With a strong focus on written communication, this course asks you develop insights and business plans for businesses who want to expand their operations to international markets. This is an Advanced Composition Course, and fulfills the ACP requirement for UIUC students. Students in ACES and the College of Business who are interested in international careers will benefit from this course?s approach to business writing.  Students on diverse or international scientific teams will benefit from learning group dynamics and project management skills in this course.  Humanities students who will study or work abroad will benefit from this course?s emphasis on diversity and culture.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "12:00 PM", "end": "12:50 PM", "daysOfTheWeek": "MWF", "roomNumber": "G27", "buildingName": "Foreign Languages Building", "instructors": {"instructor": {"firstName": "A", "lastName": "Moss", "content": "Moss, A"}}}}}