{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/101/34528.xml", "id": "34528", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/101.xml", "id": "101", "content": "Intro to Poetry"}}, "sectionNumber": "T", "statusCode": "A", "sectionText": "The English Department Course Catalogue provides you with a check list of what in theory you will be offered in this course (see below). But it does not mention the pleasures that lie in store for us as we commit to fifteen weeks of poetry-reading. Among these I hope you will experience the pleasure of listening (because poetry is the art of structuring sound), the luxury of postponing hasty arrival at meaning (because the best poetry has so much to say and such special ways of saying it), and the great rewards of patience (because poetry teaches the complexity of somatic, emotional truth, and the enormous difficulty of establishing it). Our textbook will be The Norton Introduction to Poetry, Ninth Edition, BUT BUY EARLY TO AVOID HIGH PRICES. English 101 provides students with a foundation in the methods of close reading and analysis essential to an understanding of poetry and, more broadly, to the study of literature. Furthermore, it introduces students to the ways we write and make arguments about poetry. The course addresses the basics of prosody, aspects of poetic language (such as diction, metaphor, image, tone), and major verse forms (such as the sonnet, elegy, ode, ballad, dramatic monologue, free verse). In addition to the formal qualities of poetry, students will also study poems from a range of literary periods and movements in order to learn how these formal qualities change and develop over time as well as how poems are both shaped by and, in some cases, even manage to shape their (and perhaps our) world. Students will write twelve to fifteen pages of interpretation or criticism, spread out over two or more essays, and also take a midterm and a final examination.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "03:30 PM", "end": "04:45 PM", "daysOfTheWeek": "TR", "roomNumber": "119", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "J", "lastName": "Saville", "content": "Saville, J"}}}}}