{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/ENGL/200/39032.json", 
    "id": "39032", 
    "meetings": {
        "meeting": {
            "buildingName": "English Building", 
            "daysOfTheWeek": "TR", 
            "end": "01:45 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Spires, D", 
                    "firstName": "D", 
                    "lastName": "Spires"
                }
            }, 
            "roomNumber": "115", 
            "start": "12:30 PM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Intro to the Study of Lit", 
            "href": "/2017/spring/ENGL/200.json", 
            "id": "200"
        }, 
        "subject": {
            "content": "English", 
            "href": "/2017/spring/ENGL.json", 
            "id": "ENGL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "Q", 
    "sectionStatusCode": "A", 
    "sectionText": "This course has been aptly called, ?How to Be an English Major.? It?s your introduction to literary studies?what we do, how we do it, and why?and will help you develop the core reading habits and analytical skills needed for upper-level coursework. We?ll think about how literary texts produce meaning, how that meaning production affects the world literature inhabits, and how definitions and ideas about literature?s ?work? have changed over time. We will read a variety of texts?prose fiction, poetry, drama, comics, film, and some that defy easy categorization?from a variety of literary traditions and eras. In each instance, we?ll use primary texts in conjunction with criticism to think about genre and form as historically contingent and fluid categories shaping and shaped by our experiences with literature.  Our goal will be to cultivate a vocabulary, theoretical toolbox, and set of reading and writing practices for constructing persuasive, evidence-based arguments about and through literature. Assignments will include regular reading journals and three short essays.  Writers up for consideration: Phillis Wheatley, Nathaniel Hawthorne, Octavia Butler, Kate Chopin, Franz Kafka, August Wilson, James Baldwin, Lin-Manuel Miranda, and others.", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}