{
    "creditHours": "2 hours", 
    "endDate": "2017-03-10-06:00", 
    "enrollmentStatus": "Open (Restricted)", 
    "href": "/2017/spring/LIS/590/36887.json", 
    "id": "36887", 
    "meetings": {
        "meeting": {
            "daysOfTheWeek": "R", 
            "end": "05:50 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Wilson, W", 
                    "firstName": "W", 
                    "lastName": "Wilson"
                }
            }, 
            "start": "04:30 PM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Advanced Problems in LIS", 
            "href": "/2017/spring/LIS/590.json", 
            "id": "590"
        }, 
        "subject": {
            "content": "Library and Information Science", 
            "href": "/2017/spring/LIS.json", 
            "id": "LIS"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "A", 
    "sectionDateRange": "Meets 17-Jan-17 - 10-Mar-17.", 
    "sectionDeptRestriction": "Restricted to students in the Information Sciences department.", 
    "sectionNumber": "EDI", 
    "sectionStatusCode": "A", 
    "sectionText": "The opening night of any exhibition is the culmination of many months and sometimes years of planning centered around an initial core idea for a show. After that idea has gelled into a working concept, it is handed to Design and Installation Specialists to see what is really possible. Can we have all the art suspended from wires? Can the ceiling support a replica of a sea mine? Can we devise a secure vitrine for this priceless manuscript? Does this meet ADA restrictions? How will everything fit together? Can we get that look? This course will address how exhibitions attains a specific \"look\"? This is not a course on developing or curating the information, but rather a course on presenting that information in the most compelling way. We will look at the planning, fabricating, painting, building, and installing are large parts of our work. We also have to consider that nothing, with few exceptions, is permanent. Our work needs to be secure and stable, but also reversible to make way for the next show. We will also survey the conceptual and procedural dimensions of carrying an exhibition through from curatorial musings to the reality of opening night. We will cover the techniques and processes that begin with a dialogue and move into the concrete. We will discuss the \"what's possible\" response to the initial idea. We will discuss the collaborative aspects of working with Curators, Directors of Cultural Institutions, Registrars, Collections Managers and Architects. The course will be a mix of discussion and hands-on experience with some courses taking place in the Krannert Art Museum workshop.Location: Room CRL, Krannert Art Museum", 
    "sectionTitle": "Exhibit Design & Installation", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}