{"creditHours":"4 hours","endDate":"2017-05-03-05:00","enrollmentStatus":"Open (Restricted)","href":"/2017/spring/LIS/590/60644.json","id":"60644","meetings":[{"daysOfTheWeek":"R","end":"09:00 PM","id":"0","instructors":[{"firstName":"K","lastName":"Trainor","name":"Trainor, K"}],"start":"06:30 PM","type":{"code":"E9 ","label":"Online"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/LIS/590.json","id":"590","label":"Advanced Problems in LIS"},"subject":{"href":"/2017/spring/LIS.json","id":"LIS","label":"Library and Information Science"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionDeptRestriction":"Restricted to students in the Information Sciences department.","sectionNumber":"MGL","sectionStatusCode":"A","sectionText":"Project management skills are essential for LIS practitioners who want to be leaders. Effective project management is needed to create everything from digital libraries, to community informatics outreach projects, to new physical library facilities. This is a comprehensive course in project management for anyone who is serious about planning and managing successful projects. This course combines knowledge, tools and techniques that are common to managing successful projects in any field with insight into the special challenges of managing projects in the LIS field. General project management subjects covered include a framework for project management, as well as the key project management knowledge areas: integration, scope, time, cost, quality, human resource, communication, risk, and procurement. Specific LIS project management subjects covered include the demand for project management skills in libraries, case studies of projects in both large and small libraries, and methods for addressing the special challenges of digital library projects. [First offered Summer 2008] Restricted to graduate students in the School of Information Sciences. All other students need department approval. Email ischool-advising@illinois.edu.","sectionTitle":"Project Management for LIS","startDate":"2017-01-17-06:00","statusCode":"A"}
