{
    "creditHours": "4 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/LIS/590/65589.json", 
    "id": "65589", 
    "meetings": {
        "meeting": {
            "buildingName": "Grad Sch of Lib & Info Science", 
            "daysOfTheWeek": "T", 
            "end": "12:50 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Underwood, W", 
                    "firstName": "W", 
                    "lastName": "Underwood"
                }
            }, 
            "roomNumber": "131", 
            "start": "10:00 AM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Advanced Problems in LIS", 
            "href": "/2017/spring/LIS/590.json", 
            "id": "590"
        }, 
        "subject": {
            "content": "Library and Information Science", 
            "href": "/2017/spring/LIS.json", 
            "id": "LIS"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "DSH", 
    "sectionStatusCode": "A", 
    "sectionText": "Human culture provides an ideal testbed for students exploring data science, because the interpretive challenges that lurk beneath the surface in other domains become starkly visible here. For instance, cultural materials usually come to analysts as unstructured texts, images, or sound files, forcing explicit decisions about data modeling and feature extraction. Cultural questions also highlight the importance of interpreting statistical models in relation to a social context. Last but not least: songs, poems, and stories confront us with vivid problems that are inherently fun to explore. This course will start by reviewing descriptive and inferential statistics, and build up to applications of supervised and unsupervised machine learning. We will apply those methods to a range of cultural materials ? using them to model the pace of stylistic change in popular music, for instance, and the representation of gender in fiction. A semester of programming experience (or a concurrent programming course) is recommended, but exceptions can be made with permission of the instructor.", 
    "sectionTitle": "Data Science in the Humanities", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}