{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/ENGL/255/32075.json", 
    "id": "32075", 
    "meetings": {
        "meeting": {
            "buildingName": "Lincoln Hall", 
            "daysOfTheWeek": "MW", 
            "end": "12:50 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Loughran, P", 
                    "firstName": "P", 
                    "lastName": "Loughran"
                }
            }, 
            "roomNumber": "1092", 
            "start": "12:00 PM", 
            "type": {
                "code": "LEC", 
                "content": "Lecture"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Survey of American Lit I", 
            "href": "/2017/spring/ENGL/255.json", 
            "id": "255"
        }, 
        "subject": {
            "content": "English", 
            "href": "/2017/spring/ENGL.json", 
            "id": "ENGL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "AL1", 
    "sectionStatusCode": "A", 
    "sectionText": "This course asks you to think broadly about American culture from some of its earliest iterations up until the crackup called the Civil War.  By looking at a wide variety of texts?paintings, novels, songs, poems, and even a few films?we will try to get to know American culture both through its parts (specific genres, texts, and authors) and through our own cohesive reconstruction of these parts into an integrated whole?a story, which we will call, in our class, ?American Literature, Part I.? To do this, we will draw our reading material both from ?then? and ?now??reading literature from an earlier moment alongside literature by writers today who are thinking about that moment. Our reading list will thus include distant genres (like the captivity narrative, the slave narrative, the lyric poem, and the sentimental novel) and more contemporary genres (like the graphic novel, the conceptual poem, the hip-hop song, the postmodern film).  This will thus be a course that will not just introduce you to the basic facts of American cultural history but challenge you to theorize the practice of ?literary history?? a particularly powerful form of storytelling when wielded by a reader who knows it.", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}