{"endDate":"2017-05-03-05:00","enrollmentStatus":"CrossListOpen (Restricted)","href":"/2017/spring/MDVL/508/43537.json","id":"43537","meetings":[{"buildingName":"English Building","daysOfTheWeek":"W","end":"05:50 PM","id":"0","instructors":[{"firstName":"R","lastName":"Trilling","name":"Trilling, R"}],"roomNumber":"113","start":"03:00 PM","type":{"code":"LCD","label":"Lecture-Discussion"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/MDVL/508.json","id":"508","label":"Beowulf"},"subject":{"href":"/2017/spring/MDVL.json","id":"MDVL","label":"Medieval Studies"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNumber":"G","sectionStatusCode":"A","sectionText":"Beowulf has been a foundational text of the English literary canon since J.R.R. Tolkien?s 1936 lecture on ?The Monsters and the Critics,? and it formed the bedrock of philological studies long before that. Although most students will have encountered Beowulf in at least one undergraduate literature course, this course offers an opportunity to work with the text in its original language of composition. During the semester, students will work through Beowulf in Old English while also working through the poem?s critical history. Beginning with the landmark Tolkien essay, students will survey a range of Beowulf criticism, from its philological origins to the most recent theoretical reappropriations of the text. We will consider major critical issues such as the dating of Beowulf, its manuscript context, Christian and pagan influences, sources and analogues, historical background, orality and literacy, gender, empire, and canonicity. We will make use of 21st century tools such as The Electronic Beowulf to bring the manuscript into the classroom, and we may even have time to discuss modern reflexes of the poem, such as the Julie Taymor opera Grendel and the film Beowulf directed by Robert Zemeckis. Our primary text will of course be Beowulf itself. Readings will also include a course packet of secondary literature. Students will be responsible for less formal in-class discussions, prepared presentations to the rest of the seminar, and a formal seminar-length paper at the end of the term. A reading knowledge of Old English is required for this course; students who have taken ?Introduction to Old English? or the equivalent will be adequately prepared. Undergraduates may register with the consent of the instructor.","startDate":"2017-01-17-06:00","statusCode":"A"}
