{
    "creditHours": "4 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "CrossListOpen (Restricted)", 
    "href": "/2017/spring/ENGL/449/32185.json", 
    "id": "32185", 
    "meetings": {
        "meeting": {
            "buildingName": "English Building", 
            "daysOfTheWeek": "MW", 
            "end": "12:15 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Murison, J", 
                    "firstName": "J", 
                    "lastName": "Murison"
                }
            }, 
            "roomNumber": "119", 
            "start": "11:00 AM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "American Lit 1820-1865", 
            "href": "/2017/spring/ENGL/449.json", 
            "id": "449"
        }, 
        "subject": {
            "content": "English", 
            "href": "/2017/spring/ENGL.json", 
            "id": "ENGL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNotes": "Restricted to Graduate - Urbana-Champaign.", 
    "sectionNumber": "1G", 
    "sectionStatusCode": "A", 
    "sectionText": "Have you reckoned a thousand acres much? Have you reckoned the earth much? Have you practiced so long to learn to read? Have you felt so proud to get at the meaning of poems? Stop this day and night with me and you shall possess the origin of all poems? ?Walt Whitman, Leaves of Grass, 1855 American Romanticism.  Whitman?s brash challenge to his readers?his declaration that there is something more to life beyond ownership and measurement, beyond formal education, even beyond the poem in the book you?re reading?serves as a perfect opening to the concerns of this course. There are few eras more tumultuous than the period between the signing of the Missouri Compromise in 1820 and the outbreak of the Civil War. Marked by economic panics, westward expansion, and brawling electoral politics, and over it all the fierce debates over and daily urgencies of slavery, this is also the era of American Romanticism, where we see writers urging fellow citizens to dispense with the past and engage in an original relation with the universe. Together we will read such writers as Herman Melville, Frederick Douglass, Lydia Maria Child, Henry David Thoreau, Harriet Jacobs, and, of course, Walt Whitman, all of whom posed this romantic challenge to their generation?through their experimental writing and in their urgent political commitments. The aim of the course is twofold: a deeper appreciation of the literary movement of American Romanticism (including those authors who dissented from its more optimistic modes) and a firmer understanding of the relation of romanticism to political activism in the fight against slavery.", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}