{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CWL/276/65126.xml", "id": "65126", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CWL.xml", "id": "CWL", "content": "Comparative and World Literature"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CWL/276.xml", "id": "276", "content": "Asian Film Genres"}}, "sectionNumber": "R", "statusCode": "A", "sectionText": "This brand new course (which is under consideration to count for General Education) offers a close study of popular film genres produced and circulated in Asia that have had impact on cinema and other cultural forms across the region and beyond. The course takes a necessarily selective and focused historical and transnational comparative approach to analyzing shifting narrative and visual and other cinematic realizations of each genre across different contexts, including Western reception and cross-cultural adaptations). The countries in which the selected films under study get (co-)produced and the potential genres the course might consider are myriad, of course, including martial arts, horror, musicals, anime, melodramas, science fiction, monster movies, and comedy.  On its first offering in Spring 2017, the course will emphasize the first three genres underlined above, as these have emerged since the 1960s and much more recently from film producers in East and Southeast Asia (with initial focus on films made in Japan and Hong Kong, with attention then turning to works also from Thailand, South Korea, and the Philippines as well as India).  Students may with instructor approval be able to write at least one essay about additional genres and producing countries. Requirements:  scrupulously regular class attendance and participation; attentive, timely reading in the substantial course packet of critical essays (no other course textbook); assigned out-of-class viewing of some feature films (some viewing occurs in class); and willingness to work (with instructor help) on honing writing skills through several short Moodle postings and two more formal 5pp writing assignments. You will need to meet with fellow students out of class to prepare a group oral presentation on an assigned reading or film and we will have a final during the regular time-table-scheduled time that will test mastery of key terms, developments, figures, approaches and concepts studied up to that point through an objective ?identifications/definition? section and an exam essay question.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "CrossListOpen", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "01:00 PM", "end": "02:50 PM", "daysOfTheWeek": "TR", "instructors": {"instructor": {"firstName": "R", "lastName": "Curry", "content": "Curry, R"}}}}}