{
    "creditHours": "3 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "CrossListOpen (Restricted)", 
    "href": "/2017/spring/MDVL/411/32133.json", 
    "id": "32133", 
    "meetings": {
        "meeting": {
            "buildingName": "English Building", 
            "daysOfTheWeek": "MWF", 
            "end": "11:50 AM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Barrett, R", 
                    "firstName": "R", 
                    "lastName": "Barrett"
                }
            }, 
            "roomNumber": "104", 
            "start": "11:00 AM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Chaucer", 
            "href": "/2017/spring/MDVL/411.json", 
            "id": "411"
        }, 
        "subject": {
            "content": "Medieval Studies", 
            "href": "/2017/spring/MDVL.json", 
            "id": "MDVL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNotes": "Restricted to Undergrad - Urbana-Champaign.", 
    "sectionNumber": "1U", 
    "sectionStatusCode": "A", 
    "sectionText": "The poems of Geoffrey Chaucer entangle themselves in the nonhuman world: the narrators of Chaucer?s dream visions encounter lecturing eagles and sexy daisies, while the pilgrims of the Canterbury Tales tell stories of mudbound oxen, deadly black rocks, and blabbermouth crows. Indeed, in Chaucer?s worldview, humans are themselves entities caught between heaven and earth, spirit and flesh, reason and instinct. They are simultaneously ?creatures? (God?s premiere creations) and ?critters? (Donna Harraway?s homespun term for ?the motley crowd of living beings including microbes, fungi, humans, plants, animals, cyborgs, and aliens?). We?ll use these ecologically-inflected insights as points of entry into Chaucer?s poetry, working our way over the course of the semester through the dream visions (Book of the Duchess, Parliament of Fowls, House of Fame, and Legend of Good Women) and a sizable selection of Canterbury Tales. As we?ll see, medieval ideas of nature necessarily impinge on concepts of culture: Chaucerian critters will help us explore (among other topics) the imminent obsolescence of chivalry, the urgent necessity for female counsel, and the role of faith in an age of heresy and clerical corruption. The ?English literature? we study here at the University of Illinois comes into being in Chaucer?s late fourteenth-century England, an island society struggling to recover from the depredations of Yersinia pestis, the microbial critter responsible for the demographic disaster known as the Black Death. Our task in ENGL 411 will be to explore Chaucer?s place in the mesh of this medieval natureculture.  A note about language: we will be reading Chaucer?s poems in their original Middle English (and I?ll be testing you on your facility with that earlier form of the English language). But you will have lots of opportunities to practice and develop your Middle English skills before any sort of evaluation takes place. (I?m thinking the midterm exam is the logical place to test Middle English comprehension, leaving the final exam to concentrate on the interpretative side of things.) Written work will include a few short methods-based papers, but the primary research focus of the course will be the Critter Project, an assignment asking you to become in-class experts on a variety of Chaucerian critters.", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}