{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/380/51868.xml", "id": "51868", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/380.xml", "id": "380", "content": "Topics in Writing Studies"}}, "sectionNumber": "X", "sectionTitle": "Black Freedom Movement Rhet", "statusCode": "A", "sectionText": "Topic Section X: Black Freedom Movement Rhetorics This course explores historical and contemporary rhetorics of freedom by people of the African diaspora as they emerge in social movements from the 19th century to the present. Merging rhetorical analysis with Black feminist and Black queer theory and praxis, we will examine the rhetorical strategies people of African descent have employed in speeches, essays, photography, visual arts, popular music, and fashion/style, to assert their right and desire to define their life on their own terms and discuss the world as they see and experience it. Among the movements explored will be those for the abolition of slavery, desegregation, voting rights, Black Power, Black Feminisms, Black LGBTQ sociopolitical activism, organizing against political imprisonment, #BlackLivesMatter, and the wave of student activism against racism and discrimination on college campuses. These movements for Black Freedom?varied and complex in their own right?will be discussed alongside assigned readings in rhetorical theory, Black feminist and Black queer theory, African American/African diasporic history, Women?s and Gender history, LGBT history, queer theory, and fashion studies. Doing so, students will gain a more complex understanding of Black Freedom Movement Rhetorics that spans time, circumstance, and a diversity of publics. Though not required, it would be helpful if students have taken a previous course in rhetoric, African American Studies, critical race/ethnic studies, feminist and gender studies, or LGBTQ studies. In sum, students will be expected to do the work required to become critically engaged readers and writers on the topic of the history and theory of Black Freedom Movement Rhetorics.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "CrossListOpen", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "12:30 PM", "end": "01:45 PM", "daysOfTheWeek": "MW", "roomNumber": "119", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "E", "lastName": "Pritchard", "content": "Pritchard, E"}}}}}