{"creditHours":"4 hours","endDate":"2017-05-03-05:00","enrollmentStatus":"CrossListOpen (Restricted)","href":"/2017/spring/ENGL/416/39243.json","id":"39243","meetings":[{"buildingName":"English Building","daysOfTheWeek":"MWF","end":"11:50 AM","id":"0","instructors":[{"firstName":"A","lastName":"Stevens","name":"Stevens, A"}],"roomNumber":"150","start":"11:00 AM","type":{"code":"LCD","label":"Lecture-Discussion"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/ENGL/416.json","id":"416","label":"Topics in Brit Drama to 1660"},"subject":{"href":"/2017/spring/ENGL.json","id":"ENGL","label":"English"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNotes":"Restricted to Graduate - Urbana-Champaign.","sectionNumber":"1G","sectionStatusCode":"A","sectionText":"Topic Section 1U: Drama of Shakespeare?s Contemporaries When the bad bleeds, then is the tragedy good: so says Vindice in The Revenger?s Tragedy. This course surveys several of the more lurid tragedies written by such writers as Thomas Kyd, Thomas Middleton, John Webster, John Ford, and William Heminge between 1585 and1638/9. Notable highlights from these plays include the severing of a tongue, the presentation of a heart on a dagger?s point, the dancing of a host of ?madmen?, and the ?much searing? of a heroine?s breasts. Works up for consideration are as follows: The Spanish Tragedy; The Revenger?s Tragedy; The Lady?s Tragedy; The Duchess of Malfi; The Changeling; Tis Pity She?s a Whore; and The Fatal Contract. Although our focus is on non-Shakespearean drama, we will also read Romeo and Juliet in conjunction with the 2017 Department of Theatre production of this play, and students will have the opportunity to write about Shakespeare plays not listed on the syllabus. Our focus on early modern tragedy will allow us to consider a range of questions about genre, authorship, gender, the performance of violence, and the transformation of theatrical conventions from the early days of popular theater to the last years before the theaters go dark in 1642. A particular point of emphasis will be the plays? production histories from their earliest stagings to contemporary revivals and adaptations; to this end, our textbook will illuminate early modern ?original practices? for us, and help us understand what sixteenth- and seventeenth-century spectators would have seen (and heard) when they attended a play at, say, the Globe or the Blackfriars theatres. Assignments will include short essays and response papers; a group performance project; and a final examination. Familiarity with Shakespeare helps but is not necessary.  *Please note: this class is restricted to eligible undergraduate students in the departments of English and Theatre. Any graduate student wishing to enroll in this class may do so with the explicit permission of the instructor. TEXTS: Renaissance Drama: A Norton Anthology (Bevington, Engle, Maus, Rasmussen); Tiffany Stern, Making Shakespeare from Stage to Page; and a course packet and/or critical readings distributed over email.","sectionTitle":"Shakespeare's Contemporaries","startDate":"2017-01-17-06:00","statusCode":"A"}
