{
    "creditHours": "3 hours", 
    "endDate": "2017-03-10-06:00", 
    "enrollmentStatus": "CrossListOpen", 
    "href": "/2017/spring/EURO/199/64091.json", 
    "id": "64091", 
    "meetings": {
        "meeting": {
            "daysOfTheWeek": "TR", 
            "end": "04:20 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Katsikas, S", 
                    "firstName": "S", 
                    "lastName": "Katsikas"
                }
            }, 
            "start": "02:00 PM", 
            "type": {
                "code": "LEC", 
                "content": "Lecture"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Undergraduate Open Seminar", 
            "href": "/2017/spring/EURO/199.json", 
            "id": "199"
        }, 
        "subject": {
            "content": "European Union Studies", 
            "href": "/2017/spring/EURO.json", 
            "id": "EURO"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "A", 
    "sectionNumber": "3", 
    "sectionStatusCode": "A", 
    "sectionText": "Pirates, Merchants and Cross-Cultural Interactions in the Mediterranean Sea:  This eight-week course explores the history of the region and the political, economic and cultural dynamics of Mediterranean societies from antiquity to the present day. It will appeal to students with interests in the history, art history, and archaeology of the Classical and Hellenistic Greek, Byzantine and Ottoman periods, as well as to those with a focus on the geopolitics of the Balkans, the Eastern Mediterranean and the Middle East. The course discusses issues such as the birth and development of ancient Greek Democracy and its present legacy, the rise of the ancient Hellenic world, the rise and fall of regional and global empires in the region ? the Macedonian Empire of Alexander the Great, the Roman, Byzantine, Ottoman and Arab Empires as well as the extension of the British Empire in the region ? the birth of modern nation-states in the region during the 19th and 20th century and finally the region?s integration into the mainland Europe and the European Union in the 20th and 21st centuries. The course also explores the maritime history of the region, including conflicts between pirates ? i.e. the Knights of St. John, the Barbary corsairs ? and their victims, i.e. Greek and other merchants who traded in the Mediterranean waters, migration movements to and from the region, including contemporary forms of piracy and migration.", 
    "sectionTitle": "Pirates  - Mediterranean Sea", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}