{
    "creditHours": "3 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open (Restricted)", 
    "href": "/2017/spring/CS/498/65685.json", 
    "id": "65685", 
    "meetings": {
        "meeting": {
            "buildingName": "Siebel Center for Comp Sci", 
            "daysOfTheWeek": "WF", 
            "end": "02:15 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Forsyth, D", 
                    "firstName": "D", 
                    "lastName": "Forsyth"
                }
            }, 
            "roomNumber": "1404", 
            "start": "01:00 PM", 
            "type": {
                "code": "L4 ", 
                "content": "Lecture"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Special Topics", 
            "href": "/2017/spring/CS/498.json", 
            "id": "498"
        }, 
        "subject": {
            "content": "Computer Science", 
            "href": "/2017/spring/CS.json", 
            "id": "CS"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNotes": "Restricted to Computer Science major(s). Restricted to students with Senior or Graduate class standing.", 
    "sectionNumber": "AML", 
    "sectionStatusCode": "A", 
    "sectionText": "Techniques of machine learning, with applications to various signal problems. Techniques covered will be: regression including linear regression, multiple regression, regression forests and nearest neighbors regression; classification with various methods including logistic regression, support vector machines, nearest neighbors, simple boosting and decision forests; clustering with various methods including basic agglomerative clustering and k-means; resampling methods, including cross-validation and the bootstrap; model selection methods, including AIC, stepwise selection and the lasso; hidden Markov models; model estimation in the presence of missing variables; and neural networks, including deep networks. The course is intended to support students who wish to apply machine learning methods,and will focus on tool-oriented and problem-oriented exposition. Application areas include computer vision, natural language, interpreting accelerometer data, and understanding audio data. Prereq: A course in probability or statistics, a course in linear algebra, and some programming experience", 
    "sectionTitle": "Applied Machine Learning", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}