{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/SOC/196/58848.json", 
    "id": "58848", 
    "meetings": {
        "meeting": {
            "daysOfTheWeek": "TR", 
            "end": "10:50 AM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Buckley, C", 
                    "firstName": "C", 
                    "lastName": "Buckley"
                }
            }, 
            "start": "09:30 AM", 
            "type": {
                "code": "LEC", 
                "content": "Lecture"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Issues in Sociology", 
            "href": "/2017/spring/SOC/196.json", 
            "id": "196"
        }, 
        "subject": {
            "content": "Sociology", 
            "href": "/2017/spring/SOC.json", 
            "id": "SOC"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "CB", 
    "sectionStatusCode": "A", 
    "sectionText": "Topic:  The HIV/AIDS Pandemic:  Global and Local Perspectives  The HIV/AIDS pandemic has drastically altered the global social, political, economic and demographic landscape. Delivering education concerning the virus, expanding prevention programs, monitoring the needs of countries and communities affected by HIV and AIDS, making treatment accessible and providing care continues to challenge the capacities of families, communities, countries and international organizations. While based within a socio-demographic tradition, this course draws on literatures from many disciplines to highlight the general contours, continuing debates, and ethical challenges related to the pandemic globally, nationally and within Illinois. As an introductory course, we will share strategies to enhance core academic skills focusing on effective approaches to college level reading, note taking strategies and formal writing skills. Participants will become more informed of the HIV/AIDS pandemic, learn core social science theories and develop a strong tool box of academic skills.   As an introductory course, we will share strategies to enhance core academic skills focusing on effective approaches to college level reading, note taking strategies and formal writing skills.  By the end of the term we should all be better informed about the HIV/AIDS pandemic, familiar with some basic social science theories and possess an expanded tool box of academic skills.", 
    "sectionTitle": "HIV/AIDS Pandemic Perspective", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}