{
    "courseSectionInformation": "4 graduate hours. No professional credit.", 
    "creditHours": "4 hours.", 
    "description": "Reading and literacy play a central role in all areas of LIS, as well as in education, communication, literature, and writing studies. This course considers reading as a physical, social, and educational activity that is historically and culturally situated. It provides a multidisciplinary investigation into different forms of literacy and how people acquire them. Drawing upon scholarship in LIS, education, literature, history, sociology, psychology, and anthropology, and with special consideration given to age, gender, class, religion, and culture, we will expand upon traditional notions of literacy and explore the range of scholarly approaches to the study of literacy, reading, and readers. For assignments, students choose between an experiential track, which offers practical experience through volunteer work in a literacy tutoring position, or a scholarship track, which features a research project without a volunteer component. All students have the same weekly readings and share knowledge gained from their volunteer placement and research. 4 graduate hours. No professional credit.", 
    "href": "/2017/spring/LIS/527.json", 
    "id": "LIS 527", 
    "label": "Literacy, Reading, and Readers", 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "subject": {
            "content": "Library and Information Science", 
            "href": "/2017/spring/LIS.json", 
            "id": "LIS"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "sections": {
        "section": [
            {
                "content": "A", 
                "href": "/2017/spring/LIS/527/65554.json", 
                "id": "65554"
            }, 
            {
                "content": "LE", 
                "href": "/2017/spring/LIS/527/65779.json", 
                "id": "65779"
            }
        ]
    }
}