{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CWL/410/52395.xml", "id": "52395", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CWL.xml", "id": "CWL", "content": "Comparative and World Literature"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CWL/410.xml", "id": "410", "content": "Modern African Fiction"}}, "sectionNumber": "1U", "creditHours": "3 hours", "statusCode": "A", "sectionText": "?Modern African Fiction? endeavors to highlight the connections and links (as well as the disparities) between representative writings from different regions of the African continent. Indeed, the term modern calls for precisely such an inter-textual understanding. After all, the regions we somewhat loosely territorialize as ?modern Africa? are also congruous in so far as they were almost all irredeemably transformed by the experience of colonialism. The term ?modern? has in fact since then come to be inextricably tied to the distinct twists and turns of the colonial encounter in various parts of Africa. What Simon Gikandi calls ?the colonial factor? will therefore be an important entry point into our comprehension of the isomorphisms between the required texts for the course. We will also take the term ?modern? seriously in so far as it emerges from a manner of periodization that has had a great deal to do with the novel as a generic form. As we read for the course, we will thus attempt to understand how African writers have kneaded this particular genre to the specificities of their colonial and postcolonial conditions. Given that this course reads modern African fiction in relation to theorizations of colonial and postcolonial conditions in the continent, we will not only concentrate on developing abilities such as close-reading, comparative analysis, and argumentative logic, but will also attempt to broaden the horizons of our interpretation by allowing the close reading of an individual text to be informed by readings of social structures and political-cultural events.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "CrossListOpen", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LEC", "content": "Lecture"}, "start": "01:00 PM", "end": "01:50 PM", "daysOfTheWeek": "MWF", "roomNumber": "150", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "M", "lastName": "Basu", "content": "Basu, M"}}}}}