{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/460/46884.xml", "id": "46884", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/460.xml", "id": "460", "content": "Lit of American Minorities"}}, "sectionNumber": "1G", "sectionTitle": "Hip Hop as Narrative", "creditHours": "4 hours", "statusCode": "A", "sectionText": "Topic Section 1G: Theorizing Hip Hop: Hip Hop (as) Narrative In this seminar we will apply the tools of literary theory and criticism to hip hop artistry. We will think about rap music not only as a poetic or lyric form, but as a narrative one: a medium of storytelling. While we will explicate individual performances and recordings, our larger goal will be to theorize hip hop as national discourse and contemporary cultural artifact. To that end, our study will include a great deal of recent scholarship on hip hop, particularly new analyses of hip hop aesthetics that expand upon earlier, purely historical treatments. In our work with both primary and secondary texts, we will consider the kinds of stories that rap music tells, including those that it tells about the nature of hip hop itself (hip hop meta-narratives). We will also explore the ways that hip hop culture is deployed in the telling of other types of stories, and in other media (the novel, television and film, visual art). Focusing primarily on work produced in the last fifteen to twenty years, the course will be organized thematically, addressing key topics that recur in the music and in the culture more broadly. Our primary objective will be to gain a more nuanced understanding of rap music?s aesthetic and cultural significance, through critical analysis of hip hop as performance and as social metaphor. Attendance and participation, short responses, online postings, midterm and final paper.", "sectionNotes": "Restricted to Graduate - Urbana-Champaign.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "CrossListOpen (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "12:30 PM", "end": "01:45 PM", "daysOfTheWeek": "TR", "roomNumber": "131", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "C", "lastName": "Jenkins", "content": "Jenkins, C"}}}}}