{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/301/48564.xml", "id": "48564", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/301.xml", "id": "301", "content": "CriticalApproaches to Lit&Text"}}, "sectionNumber": "C", "statusCode": "A", "sectionText": "This course will introduce you to some of the most significant contemporary interpretive methods in the study of literary texts. However, it will do so always keeping in mind the primacy of the literary text itself. At the center of the class then, we will have at least two representative literary texts which generated excitement, criticism, and debate in their own times as well as later. With these texts and their times as the ?stuff? of our business, we will study such critical movements as new criticism, deconstruction, psychoanalysis, feminist and gender studies, Marxism, new historicism, postcolonial studies, cultural studies, and reader response theory. As it prepares students for future literature classes, this course helps us understand and question the relations between reading literary texts and thinking critically, and more profoundly perhaps, between reading, criticism, and the practices involved in putting ourselves irrevocably amidst others. This course is required for English literature majors. Most English majors should take English 301 in the second semester of their sophomore year or the first semester of their junior year, but only if they have already taken several literature courses. The most common complaint about this class comes from seniors who regret not taking it sooner.  It is strongly recommended that all English and Teaching of English majors take ENGL 300 and ENGL 301 BEFORE taking any other 300- or 400-level courses.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "10:00 AM", "end": "10:50 AM", "daysOfTheWeek": "MWF", "roomNumber": "150", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "M", "lastName": "Basu", "content": "Basu, M"}}}}}