{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/EPSY/201/33932.json", 
    "id": "33932", 
    "meetings": {
        "meeting": {
            "buildingName": "Education Building", 
            "daysOfTheWeek": "F", 
            "end": "12:50 PM", 
            "id": "0", 
            "instructors": {}, 
            "roomNumber": "389", 
            "start": "11:00 AM", 
            "type": {
                "code": "DIS", 
                "content": "Discussion/Recitation"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Educational Psychology", 
            "href": "/2017/spring/EPSY/201.json", 
            "id": "201"
        }, 
        "subject": {
            "content": "Educational Psychology", 
            "href": "/2017/spring/EPSY.json", 
            "id": "EPSY"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "AD2", 
    "sectionStatusCode": "A", 
    "sectionText": "This is the basic undergraduate course in Educational Psychology that explores fundamental issues of development, learning, instruction, and assessment. This course articulates how people learn, how they are influenced by cultural and social contexts, how to assess learning and its outcomes, and how best to teach and motivate people to achieve. Educational psychologists improve learning in a broad range of settings: homes, classrooms, work environments, and communities. Prerequisite: Psych 100 Students will be required upon request to participate in a total of 3 hours of experiments outside of class. Students enrolling in a discussion/recitation section will automatically be enrolled in the lecture. Discussion sections are organized by developmental periods. Students interested in the learning and development of young children, ages 0-10, should enroll in sections AD1, AD2, or AD3. Students interested in the learning and development of early adolescents, ages 11-14, should enroll in sections AD4, AD5, or AD6. Students interested in the learning and development of adolescents, ages 15-19, should enroll in sections AD7, AD8, or AD9. Students interested in learning and development across the lifespan should enroll in sections ADA, ADB, or ADC.", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}