{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/261/62181.xml", "id": "62181", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/261.xml", "id": "261", "content": "Topics in Lit and Culture"}}, "sectionNumber": "Q", "sectionTitle": "Intro to Animal Studies in Lit", "statusCode": "A", "sectionText": "Topic Section Q: Introduction to Animal Studies and Literature The purpose of this course is to engage ?the question of the animal? as that has helped shape literary and cultural theory over the past three decades. Animal Studies (sometimes called ?Human-Animal Studies, or Animality Studies) is an interdisciplinary field overlapping with posthumanism, ecology, feminism, critical race studies, queer theory, affect theory, disability studies, and science studies; it has spawned novels, philosophies, book series, films, and serious doubts about whether or not what call the ?human? can be taken granted. Our course will focus mostly on recent works widely cited by literary scholars. It is designed, however, to help students develop reading and writing strategies easily transferable to any historical field. Philosophical and theoretical texts to be discussed include Jacques Derrida?s ?The Animal That Therefore I Am (More to Follow)?; Giorgio Agamben?s The Open: Man and Animal (excerpts); chapters from Donna Haraway?s Primate Visions, The Companion Species Manifesto, and When Species Meet; readings by Erica Fudge, Cary Wolf, and Stacy Alaimo. Literary texts to be discussed include H.G. Wells? The Island of Dr. Moreau; Franz Kafka?s The Metamorphosis; J. R. Ackerley, My Dog Tulip; J.M. Coetzee?s Lives of the Animals; works by and about Temple Grandin.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "12:30 PM", "end": "01:45 PM", "daysOfTheWeek": "TR", "roomNumber": "108", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "L", "lastName": "Cole", "content": "Cole, L"}}}}}