{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/SOCW/325.xml", "id": "SOCW 325", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/SOCW.xml", "id": "SOCW", "content": "Social Work"}}, "label": "International Development with Grassroots Organizations", "description": "This course engages students to think critically about international aid and development by cultivating an awareness of moral and ethical dilemmas that often go unconsidered by young professionals. It intends to help students develop greater cultural awareness and humility by recognizing differences in equity and global social, economic, and political structures. The course is a second eight-week offering and uses a blended learning approach with asynchronous online content combined with in-person classroom educational activities. Students apply the knowledge learned through the course by working directly with an international grassroots social organization during a 4-8 week immersion experience abroad. Course is an 8 week pre-departure training is required. Students complete a service learning placement in summer with an international grassroots organization in partnership with Omprakash EdGE.", "creditHours": "3 hours.", "sectionDateRange": "Meets 13-Mar-17 - 03-May-17.", "courseSectionInformation": "Course is an 8 week pre-departure training is required. Students complete a service learning placement in summer with an international grassroots organization in partnership with Omprakash EdGE.", "sectionRegistrationNotes": "Restricted to Undergrad - Urbana-Champaign.", "sections": {"section": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/SOCW/325/65592.xml", "id": "65592", "content": "A"}}}