{
    "courseSectionInformation": "3 undergraduate hours. No graduate credit. May be repeated in separate terms to a maximum of 6 hours. Prerequisite: Senior standing in Psychology, consent of instructor, and students must arrange to do a research project with a faculty member.", 
    "creditHours": "3 hours.", 
    "description": "Capstone experience for undergraduate students doing advanced research in any area of psychology. Provides in-depth background knowledge of their research, and teaches students to make effective oral and written presentations of their findings. In conjunction with PSYC 494, will facilitate the preparation of a Bachelor's thesis that can be submitted for the awarding of the departmental distinction at graduation. May be taken for two semesters with the first semester emphasizing a review of the literature and the second semester concentrating on the presentation of the results. 3 undergraduate hours. No graduate credit. May be repeated in separate terms to a maximum of 6 hours. Prerequisite: Senior standing in Psychology, consent of instructor, and students must arrange to do a research project with a faculty member.", 
    "href": "/2017/spring/PSYC/492.json", 
    "id": "PSYC 492", 
    "label": "Capstone Undergrad Research", 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "subject": {
            "content": "Psychology", 
            "href": "/2017/spring/PSYC.json", 
            "id": "PSYC"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "sectionApprovalCode": "Instructor Approval Required", 
    "sectionRegistrationNotes": "Restricted to Psychology major(s).", 
    "sections": {
        "section": {
            "content": "A", 
            "href": "/2017/spring/PSYC/492/55514.json", 
            "id": "55514"
        }
    }
}