{"endDate":"2017-05-03-05:00","enrollmentStatus":"Open","href":"/2017/spring/AFRO/227/65251.json","id":"65251","meetings":[{"buildingName":"Speech & Hearing Science Bldg","daysOfTheWeek":"TR","end":"03:20 PM","id":"0","instructors":[{"firstName":"N","lastName":"Thompson-Spires","name":"Thompson-Spires, N"}],"roomNumber":"113","start":"02:00 PM","type":{"code":"LCD","label":"Lecture-Discussion"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/AFRO/227.json","id":"227","label":"Studies in Black Television"},"subject":{"href":"/2017/spring/AFRO.json","id":"AFRO","label":"African American Studies"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNumber":"1","sectionStatusCode":"A","sectionText":"World of the Black Sit-Com. In the 1990s, African-American sitcoms proliferated, as series like A Different World and The Cosby Show outperformed their competitors in ratings while Martin and Living Single broke new televisual ground. With The Fresh Prince of Bel Air celebrating its 25th anniversary and still in heavy rotation, black ?90s series still shape popular U.S. and international culture. This course explores the black sitcom, with a special focus on ?90s television as a ?golden era,? in order to connect a range of themes. We will a) analyze the economic and political factors that led to the high volume of successful African-American sitcoms during the 1990s; b) historicize televisual precursors and counterparts (Amos and Andy, Sanford and Son), including black television series of the Caribbean, UK, Canada, and Nigeria (Desmond?s, Meet the Adebanjos); c) identify conventions and deviations in order to define a ?black televisual aesthetic,? including signifyin(g), the work of intertextuality, and the role of hip-hop culture; d) determine how the black sitcom offers a genealogy for mapping black drama and other television genres; and e) answer how these series have remained relevant while navigating stereotypes, respectability politics, and broader cultural shifts. Students will engage both media studies and literary studies frameworks in order to build critical research projects on an aspect of black sitcoms and their history.","startDate":"2017-01-17-06:00","statusCode":"A"}
