{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CI/569/32288.xml", "id": "32288", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CI.xml", "id": "CI", "content": "Curriculum and Instruction"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/CI/569.xml", "id": "569", "content": "Topics Discourse and Writing"}}, "sectionNumber": "G", "sectionTitle": "Fashion Rhetorics", "statusCode": "A", "sectionText": "Topic Section G: Fashion Rhetorics In this graduate seminar we will read scholarship at the intersections of rhetoric and fashion studies, a scholarly discourse cutting across a range of disciplines and fields including rhetoric and composition, literary studies, history, performance studies, ethnic studies, and sociology. We will examine a diversity of adornment performance?past and present, in everyday life and as rendered in cultural productions (e.g. arts, literature, and film) to document the emergence of fashion and style?s impact on social, political, and economic terrain, but also a myriad of critiques of fashion and style emerging from scholarly works in the field as well as in popular media. This course will especially emphasize research on rhetoric and fashion in relation to critical race theory, feminist theory, and queer theory. Engaging this scholarship, we will posit the implications of this research for the current state and next steps of fashion as an interdisciplinary field of study generally, and what the place of that field is and can be within rhetorical studies, literary studies, American Studies, and Gender, Women?s and Sexuality Studies in particular.  The course will also support the development and support of each student finding or further developing their own fashion and style studies research, writing, and creative projects, with an eye toward exploring the broad implications of their interests for theory, methodology, and pedagogy of this field. Course readings will include texts by Roland Barthes, Carol Mattingly, Minh Ha T. Pham, Valerie Steele, Tanisha C. Ford, Reina Lewis, Tiffany M. Gill, Vicki Karaminas, Anne Hollander, Elizabeth Wilson and others.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "CrossListOpen (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "03:00 PM", "end": "04:50 PM", "daysOfTheWeek": "M", "roomNumber": "113", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "E", "lastName": "Pritchard", "content": "Pritchard, E"}}}}}