{
    "creditHours": "4 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open (Restricted)", 
    "href": "/2017/spring/BADM/590/50079.json", 
    "id": "50079", 
    "meetings": {
        "meeting": {
            "buildingName": "Wohlers Hall", 
            "daysOfTheWeek": "T", 
            "end": "06:20 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Elsaleiby, A", 
                    "firstName": "A", 
                    "lastName": "Elsaleiby"
                }
            }, 
            "roomNumber": "243", 
            "start": "03:30 PM", 
            "type": {
                "code": "S7 ", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Seminar in Business Admin", 
            "href": "/2017/spring/BADM/590.json", 
            "id": "590"
        }, 
        "subject": {
            "content": "Business Administration", 
            "href": "/2017/spring/BADM.json", 
            "id": "BADM"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNotes": "Restricted to MS:Business Administrtn -UIUC, MBA: (PT) Business Adm -- UIUC, MS: Technology Management-UIUC, or MBA:Bus Administration -UIUC.", 
    "sectionNumber": "STS", 
    "sectionStatusCode": "A", 
    "sectionText": "This course is open to students pursuing the Graduate Minor or Concentration in Supply Chain Management.  The Walt Disney Company realized $300 millions in annual savings, BellSouth improved its results by $1 billion, and IBM achieved 5% improvement in their margins are just a few of the many companies exploring the benefits of applying strategic sourcing concepts. Strategic Sourcing, also known as the next evolutionary step in supply-chain, is one of the foundation blocks for transforming an organization?s practices to world-class supply management. It is a systematic approach constructed on fact-based analysis and market intelligence for optimizing an organization's supply base and improving the overall value proposition via coordinated effort between the different areas of the organization and external partners. This course will present the strategic sourcing process and its focuses on helping senior executives and managers gain sustainable competitive advantage from their supply chains. You'll learn how to go beyond negotiation, cost-cutting and contract management functions, and successfully lead the redesign and adaptation of supply chains to drive maximum benefit for the entire organization. As the scope of strategic sourcing extends beyond supplier price negotiation, we will also take into account on the total cost of ownership incorporating customer needs, organizational goals, and market conditions rather than just cost as well as on getting the best product/service at the best value rather than getting the cheapest product/service. Hence, the objective of this course is to study how to enclose the reduction of cost while maintaining and/or improving quality.", 
    "sectionTitle": "Strategic Sourcing", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}