{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/247/32062.xml", "id": "32062", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/247.xml", "id": "247", "content": "The British Novel"}}, "sectionNumber": "S", "statusCode": "A", "sectionText": "Doppelgangers, Doubles, and Divided Minds: This course will survey the transformation of the British novel through an analysis of Doppelganger narratives across more than three centuries. We will examine the ways that doubles recur and evolve from eighteenth- and nineteenth-century gothic fictions of rivalry and demonic persecution to the psychological splitting of the mind that manifests in twentieth-century post-Freudian fiction and a contemporary neuronovel. While observing the formal changes that emerge over the course of three centuries, we will also explore the ways that the Doppelganger becomes a way of expressing larger political and ideological divisions that threaten the notion of Britishness as a stable identity. Religious and national identities are often allegorized in the dark, paranoid worlds of Doppelganger novels as personal rivalries and persecutory agents. This course will not only provide an introduction to the British novel but will ask questions about the ways that identity is both grounded in otherness and divided by it. Readings will include works by William Godwin, James Hogg, Robert Louis Stevenson, Virginia Woolf, Rebecca West, Ian McEwan, and others.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "02:00 PM", "end": "03:15 PM", "daysOfTheWeek": "TR", "roomNumber": "115", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "A", "lastName": "Gaedtke", "content": "Gaedtke, A"}}}}}