{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/200/34519.xml", "id": "34519", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/200.xml", "id": "200", "content": "Intro to the Study of Lit"}}, "sectionNumber": "B", "statusCode": "A", "sectionText": "Why are we drawn to read and write about literature? What can literature reflect back to us about ourselves and our worlds? In short, what do we do as English majors, and why? In this gateway course to the major we will tackle just such questions, from foundational ones about how to write and talk about different genres to larger questions about the purposes and uses of literature today. To narrow our scope just a little, we will look at a variety of forms (drama, poetry, novels, and films) about love and romance, marriage and divorce, seduction and betrayal. By holding steady this theme, we can see how questions about romance (What is the relation of romance to the institution of marriage? How is sexual desire mediated by literature and culture? What are the elements of a compelling love story?) have long been central to imaginative writing as well as how the social and cultural urgencies of romance change over time and in different cultural settings. We will read a little in theories that will help us gain a purchase on this topic (in form/genre and in sexuality studies), but mainly we will read some dazzling literature from different eras, including (but not limited to) Shakespeare?s Romeo and Juliet, Alcott?s Little Women, Butler?s Kindred, Kushner?s Angels in America, Lynch?s Mulholland Drive, and poetry by Elizabeth Barrett Browning, Walt Whitman, and Natasha Trethewey.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "09:30 AM", "end": "10:45 AM", "daysOfTheWeek": "MW", "roomNumber": "119", "buildingName": "English Building", "instructors": {"instructor": {"firstName": "J", "lastName": "Murison", "content": "Murison, J"}}}}}