{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/373/54455.xml", "id": "54455", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/373.xml", "id": "373", "content": "Special Topics in Film Studies"}}, "sectionNumber": "F", "sectionTitle": "The Disney Phenomenon", "statusCode": "A", "sectionText": "Topic Section F: The Disney Phenomenon from Cultural, Artistic and Global Economic Perspectives Over the 94 years since the founding of the Disney Company in 1923, the name has become a household word not just in the U.S., but also internationally, particularly in recent decades through the global marketing of videos and extension of Disney theme parks abroad. This rarely offered film topics course critically explores the distinctive contributions and widespread impact of ?Disney? from multiple perspectives: as an artistic and narrative style; an American biography; a key component of the U.S. film industry; a factor in shaping American childhood and social values; an expansionary business model; and a crucial site at which to study textual representation of race, gender, and familial relations.  We will consider the cultural, economic and political impact, domestically and abroad, of the Disney productions, from early cartoons, animated features, and live-action films to the corporation?s ownership and development of television, video games, and theme parks and model communities. The central course goal is that students come to master key critical, historical and theoretical methods that enable a grasp of Disney?s force as both a particular phenomenon and an exemplary case for studying 20th-21st century media and popular cultural production. Requirements:  regular class attendance and participation; substantial reading, including a substantial scholarly book, a popular thin book, and a course packet of additional critical essays; some assigned out-of-class viewing (some viewing occurs in class); and willingness to work to hone writing skills through two short reports about out-of-class explorations of Disney manifestations, a ca. 3 pp. synopsis (following an oral presentation) on assigned readings, and a 5-6 pp. final research or interpretive essay (or a possible alternate creative assignment of comparable scope, with instructor approval). In lieu of a final, the course will have a three-quarters exam (probably given in the 12th week in class) that will test mastery of key terms, developments, figures, approaches and concepts studied up to that point through an objective ?identifications/definition? section and an exam essay question.   Students interested in the topic should approach the course knowing that it does NOT address ?Disney? from a ?fan? perspective, but rather expects students to be willing to analyze critically the company?s representational practices (in films, theme parks, etc.) over time and its regular business policies as well as the evidence of their (sometimes arguably damaging) ?cultural, artistic and economic? impact, also internationally.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "CrossListOpen", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "02:00 PM", "end": "03:50 PM", "daysOfTheWeek": "MW", "instructors": {"instructor": {"firstName": "R", "lastName": "Curry", "content": "Curry, R"}}}}}