{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/MUS/523/34782.xml", "id": "34782", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/MUS.xml", "id": "MUS", "content": "Music"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/MUS/523.xml", "id": "523", "content": "Seminar in Musicology"}}, "sectionNumber": "A", "sectionTitle": "Mus in MigrationExileDiaspora", "statusCode": "A", "sectionText": "Topic:  Music in Migration, Exile, and Diaspora. Based on the understanding that music is a moving and intangible cultural practice that gives voice not only to experiences and behaviors but also to the memories of its practitioners in various places and settings, scholars since the 1990s have repeatedly turned to cultural practices, such as music making, to study the migrant experience in exile and diaspora. In this course, we will explore the interrelations between migration, musical practice, performance, and the building of new belongings. Drawing From ethno/musicology, memory studies, and migration and diaspora studies, we will conceptualize music's relation to place and space and explore specific cases of migration while discussing the significance of musical practice for processes of integration, assimilation, as well as separation--all of which will introduce us to concepts of mobility, cultural transfer and appropriation, musical recollection, and cultural persistence. We will further study music-related aspects of political memory construction and the aestheticizing of loss and violence in, for example, film and popular culture. Based on historical and current examples of how music retrieves and interacts with social, medial, material, and political memory building, this class will further address music's implications for the construction of individual and collective memories in diasporic contexts. We will apply these theoretical perspectives to contemporary practices by studying musical performances and compositions that attempt to retrieve, maintain, or mourn memories of a lost place. The goal is to link the analysis of musical practice to the conceptual and methodological aspects discussed in class, all in hope of garnering a more comprehensive understanding of the inner workings of music, migration, memory, and the construction of belonging in exile and diaspora.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "CrossListOpen (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "specialApproval": "Instructor Approval Required", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "01:00 PM", "end": "03:50 PM", "daysOfTheWeek": "R", "instructors": {"instructor": {"firstName": "U", "lastName": "Praeger", "content": "Praeger, U"}}}}}