{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/578/54471.xml", "id": "54471", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL.xml", "id": "ENGL", "content": "English"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ENGL/578.xml", "id": "578", "content": "Seminar Lit &Other Disciplines"}}, "sectionNumber": "G", "sectionTitle": "Receptions of Fict 1780-1960", "statusCode": "A", "sectionText": "Topic Section G: The Popular and the Canonical: Understanding the Reception of Fiction, 1780-1960 Literary scholars can hardly get through a conversation without characterizing books as canonical or non-canonical. But it is far from clear what we mean. Is there a single canon? Who defined it? When did canonicity and popularity become distinct things? Are they blurring together again, or has a ?middlebrow? terrain emerged between them? If a formerly non-canonical work gets adopted on syllabi, does it become canonical? These questions sprawl across the boundary between the history of literary criticism and the sociology of culture. We?ll approach them first of all theoretically, reading influential statements about literary judgment by William Wordsworth, Q. D. Leavis, Theodor Adorno, and Pierre Bourdieu, as well as histories of reading by John Guillory, Andreas Huyssen, Deidre Lynch, and Gordon Hutner. But we will also consider reception as a practical research problem for scholars writing about particular works. How can we recover ordinary readers? responses to a book, or survey the whole history of its critical reception? Meredith McGill, Robert Darnton, and Janice Radway will guide us toward archival resources and empirical methods that cast light on those questions. We will integrate theory and methodology to look closely at a few case studies where readers? judgments about a work have been especially volatile and interesting?ranging from Jane Austen?s Emma (1815) to H. P. Lovecraft?s ?The Call of Cthulhu? (1928). Finally, we?ll pull all these elements together to form tentative hypotheses about the changing relationship between popularity and canonicity. Although the syllabus emphasizes literary examples drawn from the United Kingdom and United States, 1780 to 1960, seminar papers about reception in other periods and national contexts are welcome.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "03:00 PM", "end": "04:50 PM", "daysOfTheWeek": "M", "instructors": {"instructor": {"firstName": "W", "lastName": "Underwood", "content": "Underwood, W"}}}}}