{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/GCL/144/65053.xml", "id": "65053", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/GCL.xml", "id": "GCL", "content": "Grand Challenge Learning"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/GCL/144.xml", "id": "144", "content": "Stereotypes, Prejudice & Discrimination"}}, "sectionNumber": "A", "statusCode": "A", "sectionText": "Exploration of the issues and methods necessary to understand and conduct research into stereotyping, prejudice, and discrimination. To achieve this goal, the course will be broken up into three sections. In the first section, students will be introduced to the basic methods of how behavioral scientists develop research questions, conduct studies, reach conclusions about their findings, and ultimately generalize their findings to understand human behavior. In the second section of this course, students will read about and discuss research examining stereotyping, prejudice, and discrimination, and how these factors contribute to inequality. In the third section of the class, students will learn about research that translates basic findings from behavioral science to understand real-world consequences of stereotyping, prejudice, and inequality. Throughout the course, students will have opportunities to experience the inner workings of the behavioral science research process through touring UIUC behavioral science laboratories, completing and discussing measures of stereotyping and bias employed in the behavioral sciences, and designing and proposing their own empirical studies that would address questions related to inequality.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LCD", "content": "Lecture-Discussion"}, "start": "11:00 AM", "end": "11:50 AM", "daysOfTheWeek": "MWF", "instructors": {"instructor": {"firstName": "C", "lastName": "Stern", "content": "Stern, C"}}}}}