{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ME/598/65801.xml", "id": "65801", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ME.xml", "id": "ME", "content": "Mechanical Engineering"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/ME/598.xml", "id": "598", "content": "Special Topics"}}, "sectionNumber": "GD", "sectionTitle": "Estimation & Stochastic Cntrl", "creditHours": "4 hours", "statusCode": "A", "sectionText": "The course is aimed at broadening student knowledge of theory and applications in stochastic methods for estimation and control.  It will introduce and investigate a range of topics in this area, and does not assume strong familiarity with probabilistic methods. In additional to fundamentals, it will feature a variety of applications including:  automatic control and robotics, supply-chain optimization,  finance,  and dynamic resource allocation.   Topics covered will  be statistical inference for discrete and continuous random variables. Linear estimation with Gaussian noise. Markov decision processes, optimal policy with full state information for finite-horizon case, infinite-horizon discounted, and average stage cost problems. Bellman value function, value iteration, and policy iteration. Approximate dynamic programming. Linear quadratic stochastic control.  Example lectures: Random variables, estimation and prediction classification, continuous random vectors, recursive estimation, Kalman filter, regression and learning, probability and Monte Carlo, Markov chains, hitting times, structure of Markov chains, Markov decision processes, the Bellman-Ford algorithm, model predictive control, shortest paths, informed search, risk averse control, linear exponential quadratic regulator, hidden Markov models.", "sectionNotes": "Restricted to Graduate - Urbana-Champaign.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "LEC", "content": "Lecture"}, "start": "11:00 AM", "end": "12:50 PM", "daysOfTheWeek": "MW", "instructors": {"instructor": {"firstName": "G", "lastName": "Dullerud", "content": "Dullerud, G"}}}}}