{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BADM/590/31474.xml", "id": "31474", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BADM.xml", "id": "BADM", "content": "Business Administration"}, "course": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/BADM/590.xml", "id": "590", "content": "Seminar in Business Admin"}}, "sectionNumber": "SCA", "sectionTitle": "Supply Chain Analytics", "creditHours": "4 hours", "statusCode": "A", "sectionText": "This course is open to students pursuing the Graduate Concentration in Business Data Analytics.  This course is designed to be at the intersection of Supply Chain Management and Business Analytics. With increased IT infrastructure, improved data capture and storage technologies, and improved networking technologies, supply chains are getting inundated with data from several different sources, such as consumer transactions, consumer feedback, consumer inquiries (on-line click streams), supplier contacts, supplier coordination, and supplier evaluation, on several aspects of supply chain such as quality, cost, demand, inventory, risk, and planning, and in various formats such as social media, text, audio, video, geo-spatial, RFID and sensor data, etc. Advances in computing infrastructure such as cluster computing and cloud computing have enabled the storage, retrieval, analysis, and sharing of data over a wide geographical domain including many different supply chain nodes and agents. It is estimated that supply chain data is doubling every two years. This data explosion within supply chains have opened up the opportunity for managers to analyze the data using appropriate tools and techniques to generate insights that can help make better decisions and consequently improve supply chain efficiencies.", "sectionNotes": "Restricted to MS:Business Administrtn -UIUC, MBA: (PT) Business Adm -- UIUC, MS: Technology Management-UIUC, or MBA:Bus Administration -UIUC.", "partOfTerm": "1", "sectionStatusCode": "A", "enrollmentStatus": "Open (Restricted)", "startDate": "2017-01-17-06:00", "endDate": "2017-05-03-05:00", "meetings": {"meeting": {"id": "0", "type": {"code": "S6 ", "content": "Lecture-Discussion"}, "start": "03:30 PM", "end": "06:20 PM", "daysOfTheWeek": "W", "roomNumber": "243", "buildingName": "Wohlers Hall", "instructors": {"instructor": {"firstName": "U", "lastName": "Mukherjee", "content": "Mukherjee, U"}}}}}