{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open (Restricted)", 
    "href": "/2017/spring/MUS/414/58923.json", 
    "id": "58923", 
    "meetings": {
        "meeting": {
            "daysOfTheWeek": "MW", 
            "end": "12:20 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Praeger, U", 
                    "firstName": "U", 
                    "lastName": "Praeger"
                }
            }, 
            "start": "11:00 AM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Music and Society", 
            "href": "/2017/spring/MUS/414.json", 
            "id": "414"
        }, 
        "subject": {
            "content": "Music", 
            "href": "/2017/spring/MUS.json", 
            "id": "MUS"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "A", 
    "sectionStatusCode": "A", 
    "sectionText": "Topic:  Music In and AS Revolution. Music in revolution, revolutionary music, musical revolts, and composers as revolutionaries. In this course, we will explore multi-faceted notions of revolution and music. We will study the political and social mechanisms as well as the music of mass revolutions, such as those of the French, Russians, Chinese, and Cubans. We will also discuss predominately social revolutions, such as the 1960s counter-culture movement, the civil rights movement, the technological-digital revolution (from the phonograph to online social networks), and revolutions of social and art dance. We will further focus on revolutionary musicians like Richard Wagner, Edgard Varese, John Cage, and Pussy Riot, as well as on movements that meant to overthrow societies such as Fluxus. We will consider how music plays out inside revolution, as with Jiang Qing's Model Operas, and French sung constitutions, while also considering music outside revolution, such as the preservation of Peking Opera by the exiled Chinese in Taiwan, Beethoven's music inspired by the First Republic, and American settings in Italian operas of the late eighteenth century. Ultimately, our aim in this course is to build a framework for theoretically and practically understanding the role of music as a possible agent of revolution and, conversely, to understand revolution's role as a proponent of music.", 
    "sectionTitle": "Music In and AS Revolution", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}