{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "CrossListOpen (Restricted)", 
    "href": "/2017/spring/AFRO/501/40164.json", 
    "id": "40164", 
    "meetings": {
        "meeting": {
            "buildingName": "Gregory Hall", 
            "daysOfTheWeek": "R", 
            "end": "02:50 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Cha-Jua, S", 
                    "firstName": "S", 
                    "lastName": "Cha-Jua"
                }
            }, 
            "roomNumber": "318", 
            "start": "01:00 PM", 
            "type": {
                "code": "DIS", 
                "content": "Discussion/Recitation"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Problems African American Hist", 
            "href": "/2017/spring/AFRO/501.json", 
            "id": "501"
        }, 
        "subject": {
            "content": "African American Studies", 
            "href": "/2017/spring/AFRO.json", 
            "id": "AFRO"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "A", 
    "sectionStatusCode": "A", 
    "sectionText": "Topic:  Investigating Lynching and Racial Violence, 1867-2014. Description:  In the late sixties, Jamil Al-Amin (a.k.a. H. Rap Brown) declared, \"Violence is as American as cherry pie.\" Al-Amin's statement underscores the essential role of violence in maintaining systems of racial oppression in the United States. Racist violence was fundamental to the creation of the United States. The use of force and violence against African Americans and people of color are not options but fundamental to the maintenance of racial oppression in the U.S. Racist violence is the scaffolding upon which capitalist exploitation and white supremacy were erected. Collective violence, private and state sponsored against African Americans since emancipation has manifested itself in five dominant forms: whipping or \"white capping,\" lynching, race riots, police brutality, and hate crimes. Several forms of social control have occurred throughout the African American experience. Nonetheless, specific forms of racial violence have dominated particular historical periods. For instance, during slavery whipping was the preferred mechanism of punishment and very few blacks were lynched. After emancipation whipping now known as white capping continued but was soon eclipsed by lynching, not in raw numbers but as the most effective terrorist tool in the white supremacist arsenal. The number of black lynch victims gradually rose to supersede that of whites, such that during the nadir, 1890 to 1924, lynching had come to symbolize anti-black racial repression. Race riots were widespread in the 1830s, and in the aftermath of emancipation, they rivaled lynching as the embodiment of racial violence. However, after the turn to the 20th century, especially during the First Great Migration, they come to typify the dominant form of racial violence surpassing lynching and maintained that status into the Second World War. Beginning with the slave patrols, police brutality also has recurred throughout the African American socio-historical experience and while the practice was certainly high throughout the 20th century, particularly during the Second Great Migration, and it is extremely difficult to coordinate corroborating data, the contemporary moment, may represent to apogee of that practice of state sponsored racial violence.  This research seminar in African American history investigates lynching and other manifestations of racial violence, from the Emancipation era to the present, New Nadir, from 1867-2014. It is designed to provide training to graduate students in research skills with an emphasis on the use of African American source materials and social history methodologies. Students will spend a third of the semester reading seminal and contemporary books and articles, and major governmental reports on lynching, race riots and other forms of racial violence. This begins with African American testimonies before federal commissions about Emancipation/Reconstruction era violence, it highlights the work of anti-lynching activists such as Ida B. Well Barnett, examines the methodological approaches of sociologists, the first scholars to study lynching, and finally the course engages the work of historians, who as a discipline came to the study of racial violence. However, central to the course will be the self-activity of African Americans, other people and their allies in organizing resistance to the practice of racial terrorism. During the last two-thirds of class students will be engaged in investigating and writing a research paper on an episode or more than one incident of racial violence.", 
    "sectionTitle": "Lynching and Racial Violence", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}