{"endDate":"2017-05-03-05:00","enrollmentStatus":"Open (Restricted)","href":"/2017/spring/ENGL/537/32276.json","id":"32276","meetings":[{"buildingName":"English Building","daysOfTheWeek":"M","end":"02:50 PM","id":"0","instructors":[{"firstName":"L","lastName":"Goodlad","name":"Goodlad, L"}],"roomNumber":"113","start":"01:00 PM","type":{"code":"LCD","label":"Lecture-Discussion"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/ENGL/537.json","id":"537","label":"Seminar Victorian Lit"},"subject":{"href":"/2017/spring/ENGL.json","id":"ENGL","label":"English"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNumber":"E","sectionStatusCode":"A","sectionText":"Topic Section E: Genre and Seriality This course undertakes in-depth exploration of the nineteenth-century fictional genres that both exemplified and fueled the great wave of serialized print culture which began in the 1830s with the advent of Balzac and Dickens.  While comparisons to such genres are visible in the novels and novel series of the twentieth and twenty-first centuries, the most salient afterlife of Victorian-era fiction is arguably to be found in the millennial surge of serial television which has flourished on cable and streaming platforms since The Sopranos, The Wire, and Mad Men.  Our critical readings will focus directly on theories of genre, seriality, and the relevant material cultures including classic work by Bakhtin and Todorov as well as recent criticism by John Frow, Robyn Warhol, Franco Morretti, Jason Mittell, Sean O?Sullivan, Susan Bernstein, and others.  Our fictional readings will include Balzac?s Lost Illusions, Trollope?s Framley Parsonage, and a George Eliot novel to be chosen by the class.  We will also watch the first season of the Danish television series, Borgen. Students are advised to view additional serial television shows in advance?most especially the first two seasons of The Wire.","sectionTitle":"Genre and Seriality","startDate":"2017-01-17-06:00","statusCode":"A"}
