{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/VCM/682.xml", "id": "VCM 682", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/VCM.xml", "id": "VCM", "content": "Veterinary Clinical Medicine"}}, "label": "Wildlife Medicine", "description": "An 8-week elective course for veterinary students offered in their second or third year of the veterinary curriculum. Participation in weekly rounds and team meetings, for the purpose of independent study and training, is required. Students will be required to maintain a personal clinic journal describing case work, training, and self-assessment. Team leaders should include any training that they conduct for their teams. The journals will be reviewed at the end of the semester by the course instructors. Available to VM2 students during the first and second 8-week terms of the spring term. Available to VM3 students during the first and second 8-week terms of the fall term. May be repeated in the same term to a maximum of 2 hours. May be repeated in separate terms to a maximum of 4 hours. Prerequisite:  Enrolled students must be an active member assigned to a treatment team in the Wildlife Medical Clinic.", "creditHours": "1 hours.", "courseSectionInformation": "May be repeated in the same term to a maximum of 2 hours. May be repeated in separate terms to a maximum of 4 hours. Prerequisite:  Enrolled students must be an active member assigned to a treatment team in the Wildlife Medical Clinic.", "sectionRegistrationNotes": "Restricted to VetMed - Urbana-Champaign.", "sections": {"section": [{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/VCM/682/49141.xml", "id": "49141", "content": "E1"}, {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/VCM/682/57989.xml", "id": "57989", "content": "E2"}]}}