{
    "courseSectionInformation": "Credit is not given for UP 357 if credit for UP 347 has already been given. Prerequisite: UP 312-Communication for Planners is highly recommended or basic familiarity with InDesign, Illustrator, and SketchUp.", 
    "creditHours": "3 hours.", 
    "description": "The planning practice requires an understanding of the land development process. In this course students will learn about the decision process used for land development and the technical skills required for reading site plans. The course provides the essential skills necessary in the field of public-sector planning. Developers are required to make key determinations in the decision process for developing land. Planners are required to understand these decisions and they must possess the ability to interpret proposed site plans for development. This includes an understanding of existing conditions of land proposed for development and the impact of new development on the site and surrounding areas. This course contains three primary components in teaching an understanding of the land development process. They are: Understanding Market Decision for Developing Land; Reading Site Plans; and Assembling a Development Plan. Credit is not given for UP 357 if credit for UP 347 has already been given. Prerequisite: UP 312-Communication for Planners is highly recommended or basic familiarity with InDesign, Illustrator, and SketchUp.", 
    "href": "/2017/spring/UP/357.json", 
    "id": "UP 357", 
    "label": "The Land Development Process", 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "subject": {
            "content": "Urban and Regional Planning", 
            "href": "/2017/spring/UP.json", 
            "id": "UP"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "sections": {
        "section": {
            "content": "A", 
            "href": "/2017/spring/UP/357/65165.json", 
            "id": "65165"
        }
    }
}