{"creditHours":"4 hours","endDate":"2017-05-03-05:00","enrollmentStatus":"Open (Restricted)","href":"/2017/spring/ME/598/65720.json","id":"65720","meetings":[{"daysOfTheWeek":"TR","end":"04:50 PM","id":"0","instructors":[{"firstName":"S","lastName":"Denos","name":"Denos, S"},{"firstName":"E","lastName":"Ertekin","name":"Ertekin, E"}],"start":"03:30 PM","type":{"code":"LEC","label":"Lecture"}},{"daysOfTheWeek":"F","id":"1","instructors":[{"firstName":"S","lastName":"Denos","name":"Denos, S"},{"firstName":"E","lastName":"Ertekin","name":"Ertekin, E"}],"start":"ARRANGED","type":{"code":"LEC","label":"Lecture"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/ME/598.json","id":"598","label":"Special Topics"},"subject":{"href":"/2017/spring/ME.json","id":"ME","label":"Mechanical Engineering"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNotes":"Restricted to Graduate - Urbana-Champaign.","sectionNumber":"EO","sectionStatusCode":"A","sectionText":"This course will explore how to create a more culturally responsive and sustainable model of  engineering outreach with under-represented students. Lectures and discussions will cover topics from the history of discrimination in the US education system to current best practices in teaching and outreach at the K-12 level. Guest speakers from across the University will enrich our discussions. In the laboratory portion of this course, you will work with a group of middle school students and a local community organization to solve an engineering problem that is relevant to the middle schoolers? interests and expertise. The project will result in solutions developed collaboratively through iterative prototyping using a wide range of tools available through the University and the school and discussions with the community partner. Please note that every student must sign up for a 1.5 hour teaching practicum on Fridays and that that this course will not count toward the minimum 12-hour MechSE 500-level coursework requirement for MechSE graduate students.  This class does not count toward the 500-level in major coursework requirement for MechSE students.  Students from other departments should inquire with their department to determine if this course can be used towards their MS or Ph.D.","sectionTitle":"Sustainable Enginrng Outreach","startDate":"2017-01-17-06:00","statusCode":"A"}
