{"courseSectionInformation":"3 undergraduate hours. 4 graduate hours. Prerequisite: For graduate credit only, acceptance into the Master of Education with an emphasis on New Learning and New Literacies program is required.","creditHours":"3 OR 4 hours.","description":"Education is in a state of flux - transitioning from traditional architectures and practices to new ecologies of teaching and learning influenced by the tremendous social and technological change of our times. What changes are afoot today in workplaces, civic life and everyday community life? What are their implications for education? What are the possible impacts of contemporary social transformations on teaching and learning - including in the areas of technology, media, globalization, diversity, changing forms of work in the \"knowledge society\", and, in these contexts, changing learner needs and sensibilities? This course explores three pedagogical paradigms: \"didactic\", \"authentic\" and \"transformative\" learning. It takes a historical perspective in order to define the contemporary dimensions of what we term \"new learning\". It prepares participants to make purposeful choices and link particular theories/instructional approaches to individual and group learning goals. 3 undergraduate hours. 4 graduate hours. Prerequisite: For graduate credit only, acceptance into the Master of Education with an emphasis on New Learning and New Literacies program is required.","href":"/2017/spring/EPS/431.json","id":"EPS 431","label":"New Learning","parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"subject":{"href":"/2017/spring/EPS.json","id":"EPS","label":"Educational Policy Studies"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"sectionApprovalCode":"Instructor Approval Required","sectionDateRange":"Meets 17-Jan-17 - 10-Mar-17.","sectionRegistrationNotes":"Restricted to EDM:Ed Pol Org&Ldrshp Onl-UIUC.","sections":[{"href":"/2017/spring/EPS/431/58114.json","id":"58114","label":"ONL"}]}
