{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/MUS/519.xml", "id": "MUS 519", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/MUS.xml", "id": "MUS", "content": "Music"}}, "label": "Analytical Methods: Musicology", "description": "Practical, hands-on experience with and exposure to the transcription, analysis, theoretical constructs, and/or notation of music from any of the world's repertories examined within a musicological framework and from both a synchronic and diachronic perspective. A series of case studies posing an array of technical problems encourage students to think critically about the place of theory and analysis in the history of musicology and their own work. May be repeated, as topics vary, in the same term to a maximum of 8 hours and in separate terms to a maximum of 12 hours. Students repeating should consult with the instructor before enrolling. Prerequisite: MUS 511 and MUS 512; or consent of instructor. Graduate students in music will be considered if they passed MUS 528A (consult Class Schedule for specific section information).", "creditHours": "4 hours.", "courseSectionInformation": "May be repeated, as topics vary, in the same term to a maximum of 8 hours and in separate terms to a maximum of 12 hours. Students repeating should consult with the instructor before enrolling. Prerequisite: MUS 511 and MUS 512; or consent of instructor. Graduate students in music will be considered if they passed MUS 528A (consult Class Schedule for specific section information).", "sectionApprovalCode": "Instructor Approval Required", "sections": {"section": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/MUS/519/54983.xml", "id": "54983", "content": "A"}}}