{
    "courseSectionInformation": "5 undergraduate hours. 5 graduate hours. Prerequisite: CI 420, general education requirements in mathematics (MATH 103 or equivalent), 2 years of college science, admission to the Early Childhood Teacher Education Program. Requires concurrent enrollment in EDPR 432.", 
    "creditHours": "5 hours.", 
    "description": "The principles, place and practice of science and mathematics education in early childhood education and in the lives of young children; stresses the functional nature of science and mathematics and their inter-relatedness; presents methods, techniques, experiences, and materials of value in teaching mathematics and science in early childhood education; and the role of the classroom teacher. Opportunity for experience in field and laboratory work. 5 undergraduate hours. 5 graduate hours. Prerequisite: CI 420, general education requirements in mathematics (MATH 103 or equivalent), 2 years of college science, admission to the Early Childhood Teacher Education Program. Requires concurrent enrollment in EDPR 432.", 
    "href": "/2017/spring/CI/442.json", 
    "id": "CI 442", 
    "label": "Math, Sci, Tech in Early Child", 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "subject": {
            "content": "Curriculum and Instruction", 
            "href": "/2017/spring/CI.json", 
            "id": "CI"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "sectionCappArea": "Restricted to Admitted Teacher Ed Student students.", 
    "sectionDateRange": "Meets 17-Jan-17 - 10-Mar-17.", 
    "sectionRegistrationNotes": "Restricted to Special Education or Early Childhood Education or Early Childhood Education major(s) or minor(s).", 
    "sections": {
        "section": {
            "content": "A", 
            "href": "/2017/spring/CI/442/31944.json", 
            "id": "31944"
        }
    }
}