{"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/IE/527.xml", "id": "IE 527", "parents": {"calendarYear": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017.xml", "id": "2017", "content": "2017"}, "term": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring.xml", "id": "120171", "content": "Spring 2017"}, "subject": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/IE.xml", "id": "IE", "content": "Industrial Engineering"}}, "label": "MSFE Professional Development", "description": "This course is required to encourage participation in professional development activities. Students will be required to be in attendance for at least 70% of the Practitioner Speaker Series in addition to other sanctioned MSFE Events. The Practitioner Speaker Series is an essential part of the MSFE curriculum. It allows firsthand interaction with Quantitative Practitioners. Exposure to insights on how the financial world is changing; regarding new products and needs, evolving data and information systems, and much more. Other events might include but are not limited to special seminars, workshops and conversation groups. 1 graduate hour. No professional credit. Approved for S/U grading only. May be repeated in separate terms up to 2 hours. Note that this course is for 1 credit hour during your first and second semester and will require a mandatory final paper. Prerequisite: Graduate MS: Financial Engineering Students only.", "creditHours": "1 hours.", "courseSectionInformation": "1 graduate hour. No professional credit. Approved for S/U grading only. May be repeated in separate terms up to 2 hours. Note that this course is for 1 credit hour during your first and second semester and will require a mandatory final paper. Prerequisite: Graduate MS: Financial Engineering Students only.", "sectionRegistrationNotes": "Restricted to MS: Financial Engineering.", "classScheduleInformation": "Students must pass this seminar each semester to receive the M.S. Financial Engineering Degree. Failure to meet the requirements for this course, will result in attending that number of equivalent seminars offered within the College of Engineering (mainly ISE) or within the College of Business (mainly Finance) or additional conversation courses with the Director.", "sections": {"section": {"href": "http://courses.illinois.edu/cisapp/explorer/schedule/2017/spring/IE/527/63360.xml", "id": "63360", "content": "MSE"}}}