{
    "creditHours": "3 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/ECON/199/65630.json", 
    "id": "65630", 
    "meetings": {
        "meeting": {
            "daysOfTheWeek": "TR", 
            "end": "01:50 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Vazquez, J", 
                    "firstName": "J", 
                    "lastName": "Vazquez"
                }
            }, 
            "start": "12:30 PM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Undergraduate Open Seminar", 
            "href": "/2017/spring/ECON/199.json", 
            "id": "199"
        }, 
        "subject": {
            "content": "Economics", 
            "href": "/2017/spring/ECON.json", 
            "id": "ECON"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "A1", 
    "sectionStatusCode": "A", 
    "sectionText": "Economic Development is the study of under-developed countries and the policies that would improve economic growth and alleviate poverty in these countries.  The course discusses the economic and institutional conditions that interfere with economic development.  These conditions include lack of  education, healthcare, infrastructure, resources, and institutions.  These conditions also include wealth inequality, extreme poverty, and corruption.  This course then examines the policies that have worked to remedy these conditions, as well as the policies that have not worked.  The course also examines the interrelationships with developed countries include trade, direct investment, foreign aid and loans.  Finally, this course also addresses environmental issues and sustainable economic growth.   ***Course counts within the Certificate in International Development (Global Studies). Please check with your advisor to see if the course will count within your curriculum.***  ***Students should not take this if they already have taken ECON 450 Development Economics.***  Pre-requisites: A basic course in Economics is recommended (eg. ECON 102, ECON 103, and/or credit for an ECON 1--)", 
    "sectionTitle": "Intro to Economic Development", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}