{
    "creditHours": "3 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/GEOL/593/63310.json", 
    "id": "63310", 
    "meetings": {
        "meeting": {
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Gregg, P", 
                    "firstName": "P", 
                    "lastName": "Gregg"
                }
            }, 
            "start": "ARRANGED", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Advanced Studies in Geology", 
            "href": "/2017/spring/GEOL/593.json", 
            "id": "593"
        }, 
        "subject": {
            "content": "Geology", 
            "href": "/2017/spring/GEOL.json", 
            "id": "GEOL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "X1", 
    "sectionStatusCode": "A", 
    "sectionText": "Geophysical observations play a critical roll in assessing the evolution of shallow magma bodies and investigating their potential for remaining in stable storage conditions or developing into a hazardous eruptive system.  Seismic, potential fields, and geodesy methods provide important constraints on the rates, volumes, and melt distributions in shallow magmatic systems allowing for assessment of unrest at active systems and evaluation of eruption potential.  Combining cutting-edge geophysical and geodynamic modeling techniques is necessary to investigate the development and evolution of large upper crustal magmatic systems.  In this course we will discuss gephysical and geodynamic approaches for investigating volcanic systems.  We will utilize current journal articles as well as physical volcanology texts.  We will investigate volcanic unrest in 3-4 computer simulation problem sets aimed at providing a more in-depth understanding of volcano modeling and geophysical data analysis.  Standard Letter Grading", 
    "sectionTitle": "Volcano Geophysics & Geodynmcs", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}