{"endDate":"2017-05-03-05:00","enrollmentStatus":"Open","href":"/2017/spring/ENGL/300/32121.json","id":"32121","meetings":[{"buildingName":"English Building","daysOfTheWeek":"TR","end":"12:15 PM","id":"0","instructors":[{"firstName":"J","lastName":"Hansen","name":"Hansen, J"}],"roomNumber":"127","start":"11:00 AM","type":{"code":"LCD","label":"Lecture-Discussion"}}],"parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"course":{"href":"/2017/spring/ENGL/300.json","id":"300","label":"Writing About Lit Text&Culture"},"subject":{"href":"/2017/spring/ENGL.json","id":"ENGL","label":"English"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"partOfTerm":"1","sectionNumber":"P","sectionStatusCode":"A","sectionText":"Topic Section P: Heroism and National Identity Over the last few years we?ve been subjected to a great deal of heroic rhetoric, much of which has had a particularly partisan and political flavor. Of course, in the wake of global terrorism, we?ve witnessed nations that invoke bellicose rhetoric, but we?ve also seen a nearly unprecedented wave of superhero and super-spy texts that attempts to respond to, challenge, and, in many cases, foster this rhetoric. Why have heroes become so political? Well, that?s precisely what we?ll aim to figure out in this course. The class will trace out the logic of Western cultural nationalism by assessing its need to establish heroic ideals as ideological apparatuses. Certain heroes, it seems, pop into the cultural imaginary at moments of crisis, and this course will explore what function these fictional heroes serve for a nation?s real populace. We will also pay close attention to texts that question traditional models of heroism, texts that tend to think that heroism, like more vulgar forms of nationalism, never really hold up to careful scrutiny. Readings will include theoretical texts by Louis Althusser, Etienne Balibar, and Frantz Fanon and literary texts such as: Virgil?s The Aeneid, Poetry by Alfred Tennyson and Wilfred Owen, Arthur Conan Doyle?s Major Sherlock Holmes Stories, W.B. Yeats?s Cuchulain Play Cycle, H.Rider Haggard?s King Solomon?s Mines, Ian Fleming?s Goldfinger, Siegel and Schuster?s original Superman stories, Lee and Kirby?s Fantastic Four Masterworks Vol. One, Lee and Romita?s The Death of Gwen Stacy, and Frank Miller?s The Dark Knight Returns.  We will also view and respond to several films. Requirements will include weekly short essays, three 6-8 page essays, and active class participation.  It is strongly recommended that all English and Teaching of English majors take ENGL 300 and ENGL 301 BEFORE taking any other 300- or 400-level courses.","sectionTitle":"Heroism and National Identity","startDate":"2017-01-17-06:00","statusCode":"A"}
