{
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "Open", 
    "href": "/2017/spring/ENGL/274/59517.json", 
    "id": "59517", 
    "meetings": {
        "meeting": {
            "buildingName": "English Building", 
            "daysOfTheWeek": "TR", 
            "end": "12:15 PM", 
            "id": "0", 
            "instructors": {
                "instructor": {
                    "content": "Baron, I", 
                    "firstName": "I", 
                    "lastName": "Baron"
                }
            }, 
            "roomNumber": "149", 
            "start": "11:00 AM", 
            "type": {
                "code": "LCD", 
                "content": "Lecture-Discussion"
            }
        }
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Literature and Society", 
            "href": "/2017/spring/ENGL/274.json", 
            "id": "274"
        }, 
        "subject": {
            "content": "English", 
            "href": "/2017/spring/ENGL.json", 
            "id": "ENGL"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNumber": "P", 
    "sectionStatusCode": "A", 
    "sectionText": "Topic Section P: Technology and the Future: Speculative British Fiction At the opening ceremonies of the 2012 Summer Olympics, Danny Boyle created a pageant of British history entitled Isles of Wonder that evoked two conflicting views of the island-nation?s past and present. Initially, Boyle conjures up an easy life of shepherds and shepherdesses at one with nature on this sceptered isle set in the silver waters of the North Atlantic. But the rarified air of this landscape is soon contaminated by the engines of capitalism, churning up soot and human misery in the dark Satanic mills of England?s green and pleasant land. Boyle?s spectacle of a British utopia decimated by technology became an overarching literary theme in the hands of twentieth century writers as the hazards of mechanization led to two World Wars and a complete restructuring of the sociopolitical system that had dominated the island nation since the Norman Conquest. In this course, we?ll explore the Industrial Revolution and the impact that it had on fiction in the 20th and 21st centuries. We?ll study how it drove writers to create grim pieces of speculative fiction that presaged a dark Dystopian future for Britain. We?ll examine the image of the crumbling British estate house as industrialization drove millions of individuals to the cities looking for work to escape poverty prior to WWI, and how the cities themselves transposed into icons of urban decay. In the midcentury modernist period, as the Welfare State emerged and the country rebuilt itself up from the ashes of the Blitz, we?ll concentrate on the rise of the Labour party and how it shaped the mindset of writers. We?ll explore the issue of the postmodern surveillance state and how some novels like Deathly Hallows, presage the Brexit vote, examining how the Alt-Right, the media, the Internet, terrorism and biotechnology have the power to permanently enhance or destroy Britain?creating another pastoral utopia or a dark dystopian universe where no one survives.  Students are expected to actively participate in class discussions. There will be four short papers and an oral report. Novels and films may include: The Sweetness at the Bottom of the Pie, Brave New World, A Clockwork Orange, The Children of Men, Never Let Me Go, Skyfall, V is For Vendetta, The Last Enemy, The Golden Compass, Harry Potter and the Deathly Hallows.", 
    "sectionTitle": "Tech & Future: Spec Brit Fict", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}