{
    "classScheduleInformation": "Students interested in ASTR 100 should also consider ASTR 121 or ASTR 122 which covers the same materials and topics but in two semesters instead of one. ASTR 121 and ASTR 122 include two lectures each week and one weekly small discussion meeting for more individual attention. ASTR 121 and ASTR 122 are independent offerings and can be taken in any order. While ASTR 100, ASTR 121 and ASTR 122 are for non-science majors, problem solving with basic algebra is required. Science and astronomy majors should take ASTR 210.", 
    "courseSectionInformation": "Credit is not given for ASTR 100 if credit in any of ASTR 121, ASTR 122, ASTR 210, or equivalent has been earned. Students with credit in PHYS 211 are encouraged to take ASTR 210.", 
    "creditHours": "3 hours.", 
    "description": "One term introduction to astronomy. The nature of science; sun, planets, and moons; origin of the solar system; nature and evolution of stars; exploding stars; stellar remnants, including white dwarfs, neutron stars, and black holes; extrasolar planetary systems; galaxies and quasars; dark matter and dark energy; the Big Bang and the fate of the universe; and life in the universe. Lectures and observation; a field trip to Parkland Staerkel Planetarium may be required, nominal charge. Credit is not given for ASTR 100 if credit in any of ASTR 121, ASTR 122, ASTR 210, or equivalent has been earned. Students with credit in PHYS 211 are encouraged to take ASTR 210.", 
    "genEdCategories": {
        "category": {
            "description": "Natural Sciences & Technology", 
            "id": "NAT", 
            "{http://rest.cis.illinois.edu}genEdAttributes": {
                "genEdAttribute": {
                    "code": "1PS", 
                    "content": "UIUC: Physical Sciences"
                }
            }
        }
    }, 
    "href": "/2017/spring/ASTR/100.json", 
    "id": "ASTR 100", 
    "label": "Introduction to Astronomy", 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "subject": {
            "content": "Astronomy", 
            "href": "/2017/spring/ASTR.json", 
            "id": "ASTR"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "sectionDegreeAttributes": "Physical Sciences course.", 
    "sections": {
        "section": [
            {
                "content": "1", 
                "href": "/2017/spring/ASTR/100/30779.json", 
                "id": "30779"
            }, 
            {
                "content": "OL", 
                "href": "/2017/spring/ASTR/100/57338.json", 
                "id": "57338"
            }
        ]
    }
}