{"classScheduleInformation":"ASTR 121 and ASTR 122 cover the same topics as ASTR 100, but the material and topics are covered in much more depth over two semesters instead of one.  ASTR 121 and ASTR 122 are independent offerings and can be taken in any order. While ASTR 121 and ASTR 122 are for non-science majors, problem solving with basic algebra is required. Science and astronomy majors should take ASTR 210. Students must register for one discussion and one lecture section.","courseSectionInformation":"Credit is not given for ASTR 121 if credit for any of ASTR 100, ASTR 210, GEOL 116 has been earned. Students with credit in PHYS 211 are encouraged to take ASTR 210.","creditHours":"3 hours.","description":"Introductory survey of the solar system; structure and motions of the earth and moon; planetary motions; natures and characteristics of the planets, and small solar system bodies (comets and asteroids); planetary moons and rings; meteors, meteoroids, and meteorites; properties of the Sun; origin and evolution of the solar system; comparison of our solar system to extrasolar planetary systems. Emphasis will be placed on problem-solving and scientific methods. Two lectures and one discussion each week, and observing sessions during the term. Credit is not given for ASTR 121 if credit for any of ASTR 100, ASTR 210, GEOL 116 has been earned. Students with credit in PHYS 211 are encouraged to take ASTR 210.","genEdCategories":[{"description":"Natural Sciences & Technology","id":"NAT","attributes":[{"code":"1PS","label":"UIUC: Physical Sciences"}]},{"description":"Quantitative Reasoning","id":"QR","attributes":[{"code":"1QR2","label":"UIUC: Quant Reasoning II"}]}],"href":"/2017/spring/ASTR/121.json","id":"ASTR 121","label":"The Solar System","parents":{"calendarYear":{"href":"/2017.json","id":"2017","label":"2017"},"subject":{"href":"/2017/spring/ASTR.json","id":"ASTR","label":"Astronomy"},"term":{"href":"/2017/spring.json","id":"120171","label":"Spring 2017"}},"sectionDegreeAttributes":"Physical Sciences, and Quant Reasoning II course.","sections":[{"href":"/2017/spring/ASTR/121/30816.json","id":"30816","label":"AD1"},{"href":"/2017/spring/ASTR/121/30820.json","id":"30820","label":"AD2"},{"href":"/2017/spring/ASTR/121/30823.json","id":"30823","label":"AD3"},{"href":"/2017/spring/ASTR/121/30825.json","id":"30825","label":"AD4"},{"href":"/2017/spring/ASTR/121/30828.json","id":"30828","label":"AD5"},{"href":"/2017/spring/ASTR/121/30831.json","id":"30831","label":"AD6"},{"href":"/2017/spring/ASTR/121/57295.json","id":"57295","label":"AD8"},{"href":"/2017/spring/ASTR/121/30832.json","id":"30832","label":"AL1"}]}
