{
    "courseSectionInformation": "Credit is not given for KOR 202 if credit in KOR 222 has been earned. Prerequisite: KOR 201 or as determined by placement test and instructor. Students must have taken KOR 201 at this University. Otherwise, they must take the placement test given in January. Sign up for the test in the office of the EALC Department (244-2725).", 
    "creditHours": "5 hours.", 
    "description": "Continuation of KOR 201, and second semester of first year Korean. Students learn basic grammar, vocabulary, and commonly used expressions by practicing conversations and reading conversation based texts, to achieve beginning-intermediate levels of speaking, listening, reading, and writing in the Korean language. Credit is not given for KOR 202 if credit in KOR 222 has been earned. Prerequisite: KOR 201 or as determined by placement test and instructor. Students must have taken KOR 201 at this University. Otherwise, they must take the placement test given in January. Sign up for the test in the office of the EALC Department (244-2725).", 
    "href": "/2017/spring/KOR/202.json", 
    "id": "KOR 202", 
    "label": "Elementary Korean II", 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "subject": {
            "content": "Korean", 
            "href": "/2017/spring/KOR.json", 
            "id": "KOR"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "sectionRegistrationNotes": "Not intended for students with Senior or Graduate class standing.", 
    "sections": {
        "section": [
            {
                "content": "C", 
                "href": "/2017/spring/KOR/202/35283.json", 
                "id": "35283"
            }, 
            {
                "content": "X", 
                "href": "/2017/spring/KOR/202/40035.json", 
                "id": "40035"
            }
        ]
    }
}