{
    "creditHours": "3 hours", 
    "endDate": "2017-05-03-05:00", 
    "enrollmentStatus": "CrossListOpen (Restricted)", 
    "href": "/2017/spring/INFO/490/65142.json", 
    "id": "65142", 
    "meetings": {
        "meeting": [
            {
                "daysOfTheWeek": "F", 
                "end": "11:50 AM", 
                "id": "0", 
                "instructors": {
                    "instructor": {
                        "content": "Ginger, J", 
                        "firstName": "J", 
                        "lastName": "Ginger"
                    }
                }, 
                "start": "11:00 AM", 
                "type": {
                    "code": "L1 ", 
                    "content": "Lecture"
                }
            }, 
            {
                "id": "1", 
                "instructors": {
                    "instructor": {
                        "content": "Ginger, J", 
                        "firstName": "J", 
                        "lastName": "Ginger"
                    }
                }, 
                "start": "ARRANGED", 
                "type": {
                    "code": "LAB", 
                    "content": "Laboratory"
                }
            }
        ]
    }, 
    "parents": {
        "calendarYear": {
            "content": "2017", 
            "href": "/2017.json", 
            "id": "2017"
        }, 
        "course": {
            "content": "Special Topics", 
            "href": "/2017/spring/INFO/490.json", 
            "id": "490"
        }, 
        "subject": {
            "content": "Informatics", 
            "href": "/2017/spring/INFO.json", 
            "id": "INFO"
        }, 
        "term": {
            "content": "Spring 2017", 
            "href": "/2017/spring.json", 
            "id": "120171"
        }
    }, 
    "partOfTerm": "1", 
    "sectionNotes": "Not intended for students with Freshman class standing. Not intended for Graduate - Urbana-Champaign.", 
    "sectionNumber": "ML1", 
    "sectionStatusCode": "A", 
    "sectionText": "This course introduces learners to a variety of rapid prototyping and fabrication techniques in collaboration with the CU Community Fab Lab. Each week students will be provided a general project prompt and set to work with a tool area in response to a simple design exploration challenge. Over the course of the semester they will have an opportunity to become familiarity with the basics of several advanced small-scale manufacturing tools, such as 3D printers, laser engravers, digital embroidery machines, graphic drawing tablets and small board electronics. There is no dedicated lab section time for the course, instead students will be expected to come into open hours (Mon/Tue/Wed 2-9p; Fri/Sun 1-6p) at the Fab Lab to work on projects by seeking assistance from staff and one another, according to their own schedule each week. While there is no studio fee students will be expected to find, purchase, borrow or otherwise provide their own materials for several projects. The class will have both group and independent work and make use of Moodle for assignment hand-in, peer-feedback and to host a portfolio which will be presented at the end of the semester. Please note that this course will emphasize self-guided learning and time management, students will need to rely on online tutorials and information resources to explore methods and complete much of the work in a rapid-response fashion. Projects will be small and contained, in order to allow for exposure to several tools and mediums. Students who have taken a prior Makerspace course at the FabLab are eligible to participate in this class, but it is also not a requirement. Graduate students will have an additional documentation project component emphasizing digital literacy. This class is for undergraduate students only, at the sophomore level or higher.  Graduate students should enroll in INFO 490 section ML2.", 
    "sectionTitle": "Makerspace B: Open Studio", 
    "startDate": "2017-01-17-06:00", 
    "statusCode": "A"
}